[
  {
    "path": "posts/2021-01-23-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post presents a critical review, recommendations, and makeover of a visualization found in MOM's \"_Report: Labour Force in Singapore 2019_\"",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSection A: Critique of Original VizClarity\r\nAesthetic\r\n\r\nSection B: Suggested ImprovementClarity\r\nClarity\r\n\r\nSection C: Redesigned VisualizationMakeover Concept\r\nRedesigned Viz\r\n\r\nSection D: Step-by-Step for Viz Makeover\r\nSection E: Observations\r\n\r\nThe original visualization is presented below and can be found on Page 22 of this report\r\n\r\nSection A: Critique of Original Viz\r\nThis section provides a critique of the original visualization and comments on both clarity and aesthetic aspects that could be further improved on. A total of 8 clarity issues and 5 aesthetic issues (as shown below) were identified.\r\n\r\nClarity\r\nS/N\r\nIssue\r\nComments\r\n1\r\nTitle\r\nThe purpose and objective of the original visualization was not conveyed well in the title of the chart. It misleads people into thinking that the graph shows absolute number of labour force by age when it is in fact showing the share of each age group within the work force.\r\n2\r\nSubtitle\r\nSubtitle that says “Per Cent” does not elaborate on what this per cent is referring to, nor explain which figure is the percentage derived from what base. Together with the title, it confuses viewers on the data being presented.\r\n3\r\nAxis Label\r\nMissing explanation for the “June 2009” and “June 2019” row data – without reading the paragraph before, there is no easy way to figure out that these numbers refer to share of workers in each age group within the labour force.\r\n4\r\nY-Axis\r\nThe graphs are literally floating with no Y-axis and its corresponding values (much less any gridlines) to anchor the actual value corresponding to each age group – this is as good as drawing random lines and is a critical flaw of the original viz. There is no easy way to know if the lines are corresponding to the correct Y-value even if we are provided with the data.\r\n5\r\nChoice of Viz Type\r\nSince the data is segregated by discrete age bins, line graph – which are more suitable for continuous x-variables, should be avoided to prevent giving false impression that the data is continuous within the bin (e.g. a kink for the 45-49 age, it leaves room for misinterpretation that a downtrend from 45 years old changed to an uptrend at 47 years old).\r\n6\r\nComparison Across Year\r\nSince the objective of the visualization is to explain that there are more older workers in the labour force, the choice of two line graphs is inefficient as it requires viewers to do a mental comparison of the higher line to derive the changes over time. Bearing the objective in mind, the difference between the two years could have been calculated and directly presented instead.\r\n7\r\nLead-in Paragraph\r\nLead-in paragraph is not supported by the visualization, in fact, it creates more confusion. While the age bins are split into 5-year bands (e.g. 15-19, with the only exception being those above 70), the paragraphs discusses the share of labour force by bigger bins, lumping together those aged 55 and over, as well as the 25-54 groups. This creates confusion as the figures quotes – “from 16% in 2009 to 25% in 2019” and “declined from 75% to 67%” are all not interpretable from the visualization. The need for mental sums to add up the percentages across a few data points presented in the table is unintuitive and user-unfriendly. In terms of comparison between the years, author could have also enhance the readability by deriving the change in percentage points across the two years.\r\n8\r\nChoice of Data\r\nAs a general comment to the overall choice of data for the discussion, it might be clearer to talk about the change in Labour Force Participation Rate (LFPR) for each age group, rather than the composition of labour force – which could be more indicative of demographic change (e.g. ageing population) than shift in labour decisions.\r\nAesthetic\r\nS/N\r\nIssue\r\nComments\r\n9\r\nDefinition\r\nVisualization appears grainy and pixelated.\r\n10\r\nData Points and Labels\r\nNo softgrid nor data point to guide visual on which year corresponds to which point\r\n11\r\nFont Consistency\r\nInconsistent font colour for same data source – blue for the line is different from the blue words on chart, which is again different for the blue in the table below\r\n12\r\nChoice of Font Colours\r\nChoice of font colour does not contrast with background as well, hence not easy to read\r\n13\r\nAlignment\r\nInformation (Source and Note) at the bottom not aligned\r\nSection B: Suggested Improvement\r\nThis section provides some suggested improvements that could be implemented to resolve issues discussed in Section A.\r\nClarity\r\nS/N\r\nIssues\r\nSuggested Improvements\r\n1\r\nTitle\r\nThe title of the visualization could be modified to reflect the key message that the viz is trying to convey, and should correspond accurately to the main features of the viz\r\n2\r\nSubtitle\r\nSubtitle could be modified to provide key information to guide viewers in deciphering the viz (e.g. data and corresponding unit presented in the viz, year of data, location, and X-axis variable)\r\n3\r\nAxis Label\r\nProvide clear axis labels with accurate units of measure to prevent confusing readers\r\n4\r\nY-Axis\r\nInclusion of a Y-axis with suitable tick marks and guiding soft gridlines to enhance readability is important\r\n5\r\nChoice of Viz Type\r\nFor discrete variables (as in the bins of age range used), a bar chart would serve to provide better clarity to prevent misinterpretation\r\n6\r\nComparison Across Year\r\nTo achieve the objective to explain that there are proportionately more older workers in the labour force in 2019 than 2009, the difference between the two years could have been calculated and directly presented for a more effective visualization.\r\n7\r\nLead-in Paragraph\r\nLead-in paragraph should be supported by the viz, and any figures quoted by the paragraph should be available and obvious from the viz. Better interpretation and processing of the data (e.g. calculating and presenting the difference, if that is the objective) would also enhance clarity of the viz.\r\n8\r\nChoice of Data\r\nUsing data on the Labour Force Participation Rate (LFPR) for each age group could provide clearer comparison to achieve the objective of the viz\r\nClarity\r\nS/N\r\nIssues\r\nSuggested Improvements\r\n9\r\nDefinition\r\nEnsure visualization is not pixelated and has suitable definition\r\n10\r\nData Points and Labels\r\nProvide clear background gridline to enhance readability and data points/labels for viewer’s ease of reference\r\n11\r\nFont Consistency\r\nEnsure consistent font type and colour are used to represent distinct sets of data for consistency. Useful colors will also provide additional dimensions to enhance effectiveness of viz\r\n12\r\nChoice of Font Colours\r\nTo select contrasting colours for ease of reading\r\n13\r\nAlignment\r\nAs much as possible, to provide proper alignment within viz to reduce distraction caused by messiness\r\nSection C: Redesigned Visualization\r\nThis section presents an alternative that improves on the original visualization based on the points discussed in Section A & B.\r\nMakeover Concept\r\n\r\nRedesigned Viz\r\nThe redesigned visualization can be accessed via this link\r\n\r\nSection D: Step-by-Step for Viz Makeover\r\nxxx xxx\r\nSection E: Observations\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-27T01:26:42+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Jason's Data Analytics Blog",
    "description": "Welcome to my blog, I hope you enjoy \nreading the content of it!",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-01-23",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-23T16:42:09+08:00",
    "input_file": {}
  }
]
