[
  {
    "path": "posts/2021-03-12-dataviz-makeover-3/",
    "title": "ISSS608 DataViz Makeover 3",
    "description": "This post presents a critical review, recommendations, and makeover of a visualization using data obtained from the Armed Conflict Location & Event Data Project, available via [this link](https://acleddata.com/data-export-tool/)\n\nThis post constitutes part of the assessment for credit towards the Singapore Management Univerisity module ISSS608 Visual Analytics and Application, AY2020/2021 Term 2. \n\nFinal redesigned visualization can be found on this link: \n\nhttps://public.tableau.com/profile/jason.tey#!/vizhome/VizMakeover2_16133754027850/Dashboard",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-03-20",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSection A: Critique of Original Viz\r\nClarity\r\nAesthetic\r\n\r\nSection B: Suggested Improvement\r\nClarity\r\nAesthetic\r\nDiscussion on Geospatial Visualization\r\nFurther Discussion on Animating Changes on Geospatial Visualization\r\nDiscussion on Visualizing Changes\r\nMakeover Concept\r\n\r\nSection C: Redesigned Visualization\r\nSection D: Step-by-Step for Viz Makeover\r\nPart 1 - Data Preparation\r\nPart 2 - Creating Interactive Geospatial Dot Density Plot with Proportional Symbols\r\nPart 3 - Visualizing Change using Slopegraph\r\nPart 4 - Interactive Dashboard\r\n\r\nSection E: Observations\r\nObservation 1 - Protests are everywhere within the region, but Battles are the most deadly\r\nObservation 2 -\r\nObservation 3 -\r\nAdditional Comments\r\n\r\nAnnex - Animating Changes on Geospatial Map\r\n\r\nThe original visualization using the data available is appended below:\r\n\r\nSection A: Critique of Original Viz\r\nThis section provides a critique of the original visualization and comments on both clarity and aesthetic aspects that could be further improved on. A total of 10 clarity issues and 8 aesthetic issues were identified.\r\nClarity\r\nS/N\r\nIssue\r\nComments\r\n1\r\nCluttered Opaque Dots\r\nThis is both an aesthetic and clarity issue - dots overlapping covers other underlying dots that may be overlooked as the dots appear to be 100% opaque, this means useful information is lost, and may even mislead viewers into thinking there are lesser conflicts than really were\r\n2\r\nMissing Magnitude of Impact\r\nWhile each dot represents one conflict event, not all events are of equal impact. A peaceful protest would likely have lesser impact in the form of lives lost than a battle, but even this is not always the case. It would be useful to also visualize the number of fatalities on the map to get a sense of the deadliness of the event.\r\n3\r\nYear of Event\r\nWhile the geospatial map plotted out the conflict locations, it does not offer the option to zoom in to individual year to see how situation developed through the years\r\n4\r\nTitles\r\nTitles for both the viz and the legend are accurate, which is commendable. However, more information could be provided (e.g. clarify how many events do each dot represents on the map; what is the unit of measure for the time series viz\r\n5\r\nConfusing Repeated Color\r\nBoth the geospatial map and the time series viz uses the same shade of blue, together with the fact that the legend was placed beside the time series viz, at first glance, it appears as if the time series is only plotting changes for Battles events, which are denoted by the same shade of blue on the map.\r\n6\r\nAxes for Time Series Viz\r\nIt is unclear what “Count of Sheet1” is referring to - what exactly is the count for and what is ‘Sheet1’?\r\n7\r\nInconsistent Y-Axis scale\r\nThe Temporal viz in the trellis panes also differ from each other: from the counts for Battles from around 400 to 700 to the counts for Riots lesser than 20, they all look similar in scale. The changes are also exaggerated for those in smaller scales, distorting a realistic sense of comparison\r\n8\r\nNon-Informative Viz\r\nThe time series viz, in itself, does not provide any informative insights, other than the actual changes in the count of each types of conflict event. There is no clear patterns or trends observed in the trellis view, and with the inconsistent Y-Axis, we cannot even formulate meaningful comparison between the event counts or comment much about the trends (since events with smaller counts would have flatter lines with more minute changes if the scales are aligned)\r\n9\r\nTooltip\r\nTooltip was left as default without proper phrasing and explanation on the values of the variables. Which does not help with enhancing the clarity of the two visualizations (viewers would not have very applicable use of the longitude and latitude information provided, for example).\r\n10\r\nSource of Data\r\nThe source of data is mysteriously missing. This reduces the reliability of the data used (and could also get the viz producer into trouble, given the terms-and-condition for use of the data from ACLED)\r\nAesthetic\r\nS/N\r\nIssue\r\nComments\r\n1\r\nCluttered Opaque Dots\r\nAs mentioned earlier, this is both an aesthetic and clarity issue; apart from the lack of clarity, the cluttered dots also made it visually annoying when some dots are partially or fully hidden and it is difficult to pinpoint the exact event even when we attempt to hover over\r\n2\r\nMap Background\r\nDark background for the land masses makes it less contrasting with the dots and the boundary lines\r\n3\r\nLegend for Map\r\nWhile the color scheme is meant for the geospatial map, it is placed far away, separated by the time series viz. Beyond confusing, it also requires viewers’ eyes to track across the time series viz to see what color on the map corresponds to what event on the legend - viewers may even get distracted while doing that, or worse, frustrated.\r\n4\r\nY-Axis for Temporal Viz\r\nOther than the fact that the inconsistent Y-Axiss distort the sense of comparison, it is also ugly when there are different “gaps” between the tick marks. More critically, the repeated “Count of Sheet1” in itself is redundant, it could have been combined together as one. And lastly, the orientation of the “Count of Sheet1” means viewers have to tilt their head to read it - not as user friendly.\r\n5\r\nLack of Grid Lines\r\nThere is also a lack of vertical grid lines to help guide viewers to map the count values to the years.\r\n6\r\nX-Axis Abruptly Cut-Off\r\nX-Axis of the time series viz is cut-off at the end, with the year ‘2020’ appearing chopped up.\r\n7\r\nLack of Interactivity\r\nOther than the toggling of Country, the viz does not allow changing other variables such as Actors involved or the type of conflict event.\r\n8\r\nProportion of the Visualizations\r\nThe geospatial map takes up half the canvas, whereas the temporal viz had to share real estate with the legend and filter - this makes the overall visualization appear lopsided.\r\nSection B: Suggested Improvement\r\nThis section provides some suggested improvements that could be implemented to resolve issues discussed in Section A.\r\nClarity\r\nS/N\r\nIssue\r\nSuggested Improvement\r\n1\r\nCluttered Opaque Dots\r\nIncrease the alpha / Decrease the opacity of the dots, so as to allow overlapped dots to be visible\r\n2\r\nMissing Magnitude of Impact\r\nIncorporate the Fatalities numbers as one of the variables in the visualization. In this case, it will be a multiple-variable visualization, where dot can continue to represent one event count, color as the event type, and size as the deadliness / number of fatalities\r\n3\r\nYear of Event\r\nCreate additional filters to allow toggling of year. In fact, to better visualize changes, animation may be considered.\r\n4\r\nTitles\r\nInclude subtitles to better inform viewers of the visualization that they are looking at, especially key critical information, such as what each dot on the map represents.\r\n5\r\nConfusing Repeated Color\r\nAvoid using repeated color to represent elements of totally different nature to prevent unnecessary confusion.\r\n6\r\nAxes for Time Series Viz\r\nProvide clear axes title to make sure viewers are able to identify with the data being presented. Unit of measure should also be specified if need be.\r\n7\r\nInconsistent Y-Axis scale\r\nAxes in trellis panes should be consistent as much as possible to aid comparison. If not possible, alternative presentation approaches should be explored\r\n8\r\nNon-Informative Viz\r\nThe trellis pane viz does not have any value-add in the story told - perhaps a simple get-around is to just put all the different types in on continuous axis and differentiate the lines by different colors (consistent with what is on the map). However, authors should be mindful of the story they are interested to tell - if the changes within two particular years are not important to the viewer (i.e. how the lines change), having many kinks in the line creates more confusion. In this case, since conflict events are more ad-hoc in nature, it is more likely for viewers to be interested to know how the numbers changed from one timeframe to another (e.g. 2010 to 2020), instead of all the changes in between. A slopegraph would provide that clearer picture without additional encumbrances. If user really wants to, an option to change the start and end year may be provided to allow users to toggle between the start and end timeframe that they wish to look at.\r\n9\r\nTooltip\r\nTooltip provides a good opportunity to better inform viewers of the story behind each data point, and should be put to good use.\r\n10\r\nSource of Data\r\nInclude a source note to credit data owner!\r\nAesthetic\r\nS/N\r\nIssue\r\nSuggested Improvements\r\n1\r\nCluttered Opaque Dots\r\nIncrease the alpha / Decrease the opacity of the dots, so as to allow overlapped dots to be visible\r\n2\r\nMap Background\r\nReduce the washout of the background map\r\n3\r\nLegend for Map\r\nPlace legends where they are easy to be referred by viewers. Legends are meant to enlighten, not create more confusion.\r\n4\r\nY-Axis for Temporal Viz\r\nMake sure axes are consistent and tick marks evenly spaced out. Titles should also be horizontally oriented to reduce the need for uncomfortable head-tilts. Bottomline is: elements that are not useful in improving the story the viz is telling should be removed.\r\n5\r\nLack of Grid Lines\r\nIf need be, grid lines or point dots should be provided to guide viewers track the data points along the x and y axes. Or, clever redesigning of the viz can be done to side-step the issue by removing the need for guiding grid lines (hint: perhaps we do not need all the years on the x-axis)\r\n6\r\nX-Axis Abruptly Cut-Off\r\nMake sure axes marks are properly spaced out and visible; if needed, ensure flexibility is incorporated to allow viewers to change the size according to the size of their screen (in Tableau, change the view to “Entire View”).\r\n7\r\nLack of Interactivity\r\nInclude other variables as filters/parameters to better aid users/viewers decipher and gain insights from the visualization\r\n8\r\nProportion of the Visualizations\r\nEnsure real estate of the dashboard is maximized and visualizations are evenly-spaced and proportionate to one another\r\nDiscussion on Geospatial Visualization\r\nThere are several commonly-used geospatial visualization techniques available, these include Cartograms, Choropleth maps, Proportional Symbols, and Dot Density Maps. The original viz adopted the latter technique. Amongst them, the former (Cartograms) is the least popular, as “their use if oten more for their thratrical value (i.e. to grab the attention of an audience) and less for their ability to help folks understand subtle details of geographic datasets”\r\nThe dot density maps is useful in showing “diferences in georaphic distributions across a landscape”. In the original viz, a one-to-one dot densioty map (one dot represents one count) is used. The dot density map has the following advantages:-\r\nraw data and simple counts or rates/ratio can all be mapped (as opposed to Choropleth maps which requires the latter)\r\ndata need not be tied to enumeration units (that is, it does not require the variable of interest to be conceptually measurable anywhere in space)\r\nit works fine with black and white when color is not an option (and if color is available, it can be used to represent other variable of interest)\r\nPoints 1 and 2 are particularly important considerations in the context of our visualization - to visualize incidence of conflict events, further processing of the data (e.g. divide it by the population) would be required in order to adopt the Choropleth technique. Point 3 is an added bonus (given that Tableau has color functions available), since a Choropleth will rely on colors to represent the incidence of conflict event (in this case, potentially event per population), it loses the option to add on another dimension that a dot density map allows using color. In this case, one plausible measure to include, is the type of conflict event. In this case, each dot not only tells us that a conflict occur, but can very intuitively inform us whether it is a protest or a battle.\r\nIn fact, proportional symbols may be added onto the dot density map (in fact, it is also possible to add proportional symbols on Choropleth maps - but that is, at this juncture, besides the point). Size of each dot can also be varied to represent another added dimension - one interesting variable is “Fatality”, which allows viewers to appreciate the deadliness of each of the event. With the combination of the size and color use, it is also possible to spot types of events that generally lead to more fatalities (i.e. bigger dots) and whether they concentrate in particular regions/countries. One limitation of proportional symbol, though, is that it could lead to congestion on the map; however, it is a small issue and worthy trade-off for the added information. In fact, increasing the transparency could help alleviate part of the problem Another shortcoming is that readers generally do not estimate the areas of symbols very well - however, for the purpose of this visualization, the sizes are to give general sense of fatalities, especially between different event types, extraction of actual numbers are secondary, and can be complemented by incorporation of useful Tooltips.\r\nIn parallel, this is also one major limitation of dot density maps - they are terrible for retrieving numbers from the map, people are generally not patient in manually counting the number of dots in a region to derive the total number of events in the particular region. Similarly, the purpose of the visualization is to give a broad overview of the concentration of a particular conflict type geographically, to extract further detail, useful Tooltips would need to be added. To extract the total number of conflict in the country for the selected years, a complementary viz would be needed (see Discussion on Visualizing Changes below).\r\nIn conclusion, a dot density map with each dot representing one event, the color of the dot representing the event type, and the size of the dot representing the number of fatalities, with appropriate filters for users to toggle would serve the visualization objective of this makeover.\r\nFurther Discussion on Animating Changes on Geospatial Visualization\r\nAccording to Daassi, Nigay & Fauvet (2005), Ed Chi’s Visualization Process are structured into four steps, “namely: (1) data, (2) point of view of the data, (3) visualization space and (4) point of view on the visualization space.” Temporal data visualization can be classified based on the different anchoring points between the visualization processes of the temporal domain (i.e. the time element), and the structural domain (i.e. the factor/variable that we are interested in). Hence, the author’s taxonomy are categorised into four main groups, based on the anchoring point between the temporal and structural domains at the four different steps as described at the start of this paragraph. The authors, however, does not explicitly discuss the merits and shortcomings of each of these visualization frames.\r\nThe authors, however, did provided a further discussion on the difference between static and dynamic techniques. Dynamic techniques, as defined by the authors, have visual representation that changes automatically, and animation is frequently used to visualize spatio-temporal data. Static techniques, on the other hand, does not change automatically over time. The author of this makeover explored both the static and dynamic techniques with the existing data on hand.\r\nIn the exploration of the two models, one trade-off became apparent: dynamic animation allows for viewers to appreciate the shifts in patterns (in this case, location and deadliness of conflict events) without the need for manual toggling; however, in exchange, viewers surrender the autonomy to explore the data on their own terms. In the context of the subject ACLED dataset, with the Year set as the animating factor (i.e. for the viz to dynamically move forward through the years), viewers will not have the option to view the distribution for other time period beyond the yearly frame. In the context of conflict that can drag on through different years and for length of more than years (or decades, for the matter), having the temporal frame fixed at one calendar year may compromise on contextual nuances.\r\nFurthermore, the benefit to having the changes dynamically animated is not strong in the context of conflict events, which occurrences are more ad hoc in nature than other events, such as child mortality or basic education, where changes in their rates are more meaningfully tracked through its temporal progression. In contrast, conflict events are more “opportunistic” - indeed, they may increase or decrease through particular periods of interest, but these are consequently also periods of particular interest - it is unlikely for people to be interested in knowing the number of conflict events in Singapore between 2010 to 2020 simply because it is not a period of any particular interest. Conversely, it is interesting to know the number of conflict events, say, in the Phiippines from Jun 2016, when President Rodrigo Duterte assumed office and declared its “war on drgs” - this is a particular period because it is of particular interest (versus infant mortality rate or education rate, which is more actively tracked and hence the changes year-on-year is more meaningfully analysed).\r\nAll in all, the costs to having a dynamic visualization in this context heavily outweighs its benefits. While the author has made an attempt to incorporate an animated dynamic visualization, the eventual decision is for the dynamic model with appropriate filters that allow users to toggle for the time period that they wish to examine freely to be adopted.\r\nDiscussion on Visualizing Changes\r\nTemporal plots are aplenty. Candlestick charts, Sunburst diagram, Horizon graph, Calendar Heatmap, or even the Animated Bubble Plot made famous by the Gapminder foundation and Hans Roslings in what is now his classic TED talk, are all examples of temporal plots that data scientists use to visualize change.\r\nOne of the most commonly used ones, though, is the line chart that we see in the original visualization. Such line charts are useful to depict seasonal, cyclical, outliers or even co-variation between different series. While the line charts are useful, it does become visually complicated when there are several lines altogether (and if the lines are separated by different panels and axes, it creates other problems such as those discussed in our critque of the original viz). When minor variations between two time periods are not of major concerns or interests, it may be beneficial to remove the complexity by visualizing only the general trend of the series without the volatility within.\r\nAnimation come easily to mind when talking about visualizing changes and depicting trends - recall the immortalized story of countries around the world escaping short-lives and poor health as we progress altogether on the income scale. However, as discussed in the section above, they are not without their shortcomings. In fact, one added “inadequacy” of a, say, Gapminder-style animated bubble plot a la Hans Rosling, is the fact that we are not comparing the change in one variable with another along time (i.e. bivariate temporal relationship) - for the purpose of this dataset, we are really interested in only an univariate temporal relationship of the count or fatality of conflict events with time. This is further vindicated by the earlier conclusion we had drawn on the fact that conflict events are more random and ad-hoc in nature, as compared to, for example, infant mortality or education rates.\r\nAnother feasible and even simpler method is Slopegraphs. Edmund Tufte explains that Slopegraphs “compare changes usually over time for a list of nouns located on an ordinal or interval scale”. Tufte argues that the advantages of Slopegraphs are as follows:-\r\nthe two columns allows easy reference on how numbers in general have changed over the years;\r\nthe paired comparison allows readers to read down each line to identify how the variable has changed for each of the category/“noun” (in the case of this data set - each country). With added labels, the number associated with each of the nouns is also visibly displayed;\r\nit shows how two “nouns” (i.e. countries) differ in their rates of change;\r\nunusualy slope stands out from the overall patterns; and\r\nmost importantly, the information is both integrated through the connected contents, and separated in that “the eyes follows deveral different and uncluttered paths in looking over the data”. He argues that this allows organization of complex information hierarchically.\r\nIn addition to the above, there is also very minimal (in fact, zero!) non-data ink involved.\r\nTufte’s use of Slopegraph first came about in 1983, in his book The Visual Display of Quantitative Information. Andy Kirk, in 2013, agrees with Tufte, concurring that slopegraph is the “best way to visually expose the big stories” between two contrasting time period, with Ben Jones adding on shortly after, providing a how-to tutorial, for which some of the methods used in this visualization were referenced from.\r\nCharlie Park, in his posts on 11 July 2011, provided yet a very comprehensive list of various slopegraph-like visualization from the past, and compared them with other alternatives - in summary, his key points were that slope graphs are more layman-friendly than scatter plots and slopes are much easier to read, but caution must be given to use the same data type and units of measurement for both the left and and right sides, lest any force-ranking creates “meaning where there might not actually be any” (and hence misleads viewers). He ended off with a guide on when to use slopegraph - Basically: Any time you’d use a line chart to show a progression of univariate data among multiple actors over time, you might have a good candidate for a slopegraph. - this is exactly the situation we have here on hand!\r\nPark then followed up with another post with a discussion on other examples of Slopegraphs and related types of visualization. One example is the Whiskerslopes, that includes a “revised box plot” on each axis. The added lines could better highlight the oddball values especially in dataset with large changes between the years as a whole; in the context of our visualization, however, the small number of countries plus the fact that the general shift in numbers are less systemic, it is less applicable and may add unnecessarily confusing non-data ink. Park also further added more best practices for the creation and visualization of Slopegraphs, which were taken into consideration and adopted where feasible by the author of this makeover.\r\nMakeover Concept\r\nTaking in the points discussed above, a redesigned visualization could look like the following:\r\n\r\nAddressing Clarity Issue\r\nS/N\r\nIssue\r\nWays in which proposed viz resolve issues identified\r\n1\r\nCluttered Opaque Dots\r\nVisualization has appropriate opacity to reduce visual cluttering. Appropriate filters (e.g. year/month, event type) also allow viewers to distill insights based on specific requirements where dots will appear even less cluttered while better achieving viewer’s objective\r\n2\r\nMissing Magnitude of Impact\r\nInclusion of Fatality numbers as one additional dimension, taking on the size element, allows the magnitude of impact (or deadliness) of the event to be visualized. peaceful protests and deadly clashes will no longer appear as similar dots.\r\n3\r\nYear of Event\r\nWhile animation is rejected based on earlier discussions above, the inclusion of year, and, in fact, month filter, allows viewers to zoom in on specific timeframe of interest\r\n4\r\nTitles\r\nTitles amended with subtitles included to provide additional critical information about the viz, and hence enhance overall clarity of data presented\r\n5\r\nConfusing Repeated Color\r\ncolors are purposefully chosen and appropriately applied, with repetition avoided as much as possible\r\n6\r\nAxes for Time Series Viz\r\nAxes, if provided, should be useful with clear labels and unit of measurement - however, in the case of the slopegraph where labels and measure are presented directly at the start and end of the line, axes are less useful and contributes to redundant non-data ink that may instead confuse, not enlighten, viewers.\r\n7\r\nInconsistent Y-Axis scale\r\nNotwithstanding the fact that axes were removed, the trellis layout was altogether revamoped to merge the lines (showing just overall changes between two period) onto one common axes, so as to reduce inconsistency in scale when making comparison across country/event types (difference in event types can be found using the filters).\r\n8\r\nNon-Informative Viz\r\nLine chart was changed to slopegraph for a more informative visualization - more discussion on how it is more informative can be found above.\r\n9\r\nTooltip\r\nUseful tooltips provided in both viz\r\n10\r\nSource of Data\r\nSource of data incorporated to add robustness and completeness, while also prevent infringement of intelletual property rights (we read the T&C!)\r\nAddressing Aethetic Issue\r\nS/N\r\nIssue\r\nWays in which proposed viz resolve issues identified\r\n1\r\nCluttered Opaque Dots\r\nOpacity decreased\r\n2\r\nMap Background\r\nWashout of background map reduced\r\n3\r\nLegend for Map\r\nLengends appropriately placed and titled to prevent confusion\r\n4\r\nY-Axis for Temporal Viz\r\nAxes removed with labels and numbers directly applied on start/end of lines\r\n5\r\nLack of Grid Lines\r\nGrid Lines removed with only 2 points on X-axis remaining (i.e. start and end year)\r\n6\r\nX-Axis Abruptly Cut-Off\r\nAll elements properly spaced out in the entire view, with automatic re-sizing of the viz .\r\n7\r\nLack of Interactivity\r\nVariables as filters/parameters included to better aid users/viewers decipher and gain insights from the visualization\r\n8\r\nProportion of the Visualizations\r\nRreal estate of the dashboard is maximized and visualizations are evenly-spaced and proportionate to one another\r\nSection C: Redesigned Visualization\r\nUsing Tableau, the redesigned visualization based on the discussion points and concept presented in Section B above is created as follows:\r\n\r\nThe redesigned visualization can also be accessed via this link\r\nSection D: Step-by-Step for Viz Makeover\r\nThis section provides a step-by-step guide to recreate the redesgined visualization.\r\nPart 1 - Data Preparation\r\nStep 1 - Importing Data\r\nAfter downloading the Southeast Asian 2010-2020 dataset, open up Tableau Desktop then drag-and-drop the downloaded Excel file onto a new tableau main page.\r\n\r\nWe can leave most of the data as-is, since they are relatively clean. We proceed to open up a new Worksheet in Tableau. Once that is done, we will quickly realise that Tableau automatically classified many of the numerical variables as Measures. We will need to shift these to become Dimensions. click on the following Measures while holding down the Ctrl key:-\r\nEvent Id No Cnty\r\nGeo Precision\r\nInter1\r\nInter2\r\nInteraction\r\nISO\r\nTime Precision\r\nThese variables are shifted to Dimension as their numerical values are codes representative of something and their numbers do not have any ordinal or nominal value.\r\n\r\nPart 2 - Creating Interactive Geospatial Dot Density Plot with Proportional Symbols\r\nStep 2.1 - Base Map\r\nThe very first step to creating a geospatial visualization is to create a base map. The dataset conveniently came along with Longitudinal and Latitudinal data to map out where each of the conflict event happened; Tableau on the other hand, made it even easier by automatically recognizing that these variables have geographical role and assigned them to their correct lat-long meaning based on their name. We now drag the Longitude to Columns, and Latitude to Rows.\r\n\r\nStep 2.2 - Basic Dot Density Map\r\nWe create a basic dot density map by drag-and-dropping “Event Id Cnty”onto the Detail tab. As with any one-to-one dot density map, each of the resulting dot represents one count of the variable - in this case, a conflict event. We further enhance the map by introducing another variable - “Event Type” - onto the Color tab. This added dimension allows viewers to identify the type of event (e.g. Battle, Protest, Riot) associated with each event.\r\n\r\nStep 2.3 - Proportional Symbols\r\nKnowing the type of events and their concentration in a particular geo-spatial location is informative - however, not all events are of equal concerns: while some of the dots denotes relatively “civilized” encounters (e.g. peaceful protests, arrests of key politicians without any casualties involved), some are way more violent (e.g. battles, explosions). In this aspect, the dataset provides an appropriate variable - the number of Fatalities. To show the relative impact of each event proxied by the number of people killed during the event, we drag-and-drop the measure Fatalities onto the Size tab - the size of each dot would then provide the relative destruction (in human-life terms) of each event: the bigger the circle, the more lives the event claimed (and hence more impactful), and the smaller the inverse, the lesser the impact.\r\n\r\nWe do note that the circles are still relatively similar in size, and they are all very close together such that we are unable to distinguish dots that are overlapping. We do two further changes to enhance the dots’ appearance:\r\n\r\nFirst we enlarge the circle by first clicking on the Size tab, then sliding the slider to the right.\r\n\r\nNext, we reduce the opacity by first clicking on the Color tab, then change the Opacity to 50%.\r\nStep 2.4 - Interactivity - Filters\r\nCountry\r\nNotice that we have also included Country as a Filter (by drag-and-dropping the Country pill into the Filters tab) at this point, which will be useful later on (remember to click on the small triangle beside the blue Country pill in the Filter tab, then check “Show Filter” for the filter to appear on the right-hand pane).\r\nEvent Type\r\nWe do the same to “Event Type”. Then we change both of these filters into Single Value (Dropdown) list.\r\n\r\nActors\r\nWe also want to create a filter based on the interacting actors. To achieve this, we first have to create a few intermediate variables. First, we create a new string field called Inter1_recoded that spells out what each of the coded number in Inter1 means\r\n\r\nWe do likewise for Inter2 to create Inter2_recoded.\r\n\r\nLastly, we string these two variables together to create variable Actors that tells us the pair of actors in each conflict\r\n\r\nSimilarly. we then drag-and-drop the Actors variable onto the Filter pane and change the type to Single Value (Dropdown).\r\nStep 2.5 - Aesthetics\r\nMap Background\r\nWe next work on the aesthetics of the viz. First, the map background. While the default background is alreayd using the Light style, the background can be further faded to enhance the contrast between the various dots and the landmasses. This can be done by first clicking on the Map option on the options bar at the top, then selecting “Map Layers…” from the drop-down list. At the washout option, change the percentage to 40%.\r\n\r\nTitle\r\nNext, we double click on the title to change it to the following.\r\n\r\nStep 2.6 - Tooltip\r\nWe want viewers to be able to extract more information when they hover their mouse over - so we add in a customized Tooltip that can provide them just that.\r\nFirst, we create a new field that forms proper phrases with the parties involved - “Actors_in_phrase”.\r\n\r\nWhen there are no second actor, the variable will just return that an event was conducted “by ”.\r\nWhen the second actor is either civilians or protesters, it means someone had done something to these people, and hence, “by  on ”\r\nAnd finally, when there are two non-civilian non-protesters actors (e.g. State Forces and Rebel Groups), the events are conducted by these two actors jointly\r\nOnce that is done, we drag-and-drop the relevant fields into the Tooltip tab - for this Tooltip, we will need the following variables:\r\nActors_in_phrase\r\nAdmin1\r\nCountry\r\nEvent Type\r\nNotes\r\nSub Event Type\r\n\r\nAnd lastly, we double click on the Tooltip tab, retain the relevant variables, and edit the Tooltip as follows:\r\n\r\nWe now have an informative geospatial dot density map of conflict events with proportional representation of the fatalities.\r\n\r\nIf reader is interested, steps to include Animation on the map for dynamic visualization - which is not recommended for the purpose of this dataset - is documented in the Annex\r\nPart 3 - Visualizing Change using Slopegraph\r\nWe next open up a new Worksheet to create the second portion of the overall viz visualizing change using the Slopegraph.\r\nStep 3.1 - Data Preparation & Variable Creation\r\nAs usual, before we dive straight into creating the viz, we will do some data wrangling and create some useful variables first.\r\nYear\r\nBy default, the Year variable is of numeric dimension type, we will first need to change it to the proper Date type.\r\n\r\nAggregating Events\r\nNext, we create a variable that counts the number of events. Without any further specification to the formula, Tableau will include data entry for the count according to the filters applied.\r\n\r\nAggregating Fatalities\r\nWe also create another similar variable, this time round to sum up the fatalities\r\n\r\nSelector\r\nWe have two types of change that we can visualize - number of events and number of fatalities. We want to allow viewers to be able to toggle between these two variables to distill relevant insights. We do that by creating a Parameter. Parameters can be created by right-clicking the blank space under the Data tab on the left-most panel and selecting the “Create Parameters…” option. We call this Parameter Conflict Event or Fatalities, taking in String data type with the following list of values:\r\n\r\nAfter that, we create a variable called Selected that takes in the option selected by the viewers via the parameter:\r\n\r\nDelta & Direction\r\nWe create a variable Delta that informs us on the change in the numbers (positive if increase, negative if decreased).\r\n\r\nWe then use Delta to find out the direction of movement of the numbers of conflict event/fatalities between any two years by creating the following Direction variable\r\n\r\nFirst or Last\r\nFinally, we create a variable called First or Last - this variable will be useful in allow us to show a line on the Slopegraph for only the starting and ending year; where either one is missing, the data point will only appear as a dot.\r\n\r\nStep 3.2 - Creating Basic Slopegraph\r\nTo create a basic Slopegraph, drag-and-drop the Event Date dimension to Columns, the Selected variable (that takes in user selection of either number of fatalities or events) into Rows, and Country into the Detail tab.\r\n\r\nBut wait… this looks like a normal line graph and not slope graph! Recall earlier we mentioned the need to include the First or Last variable, now is the time. We drag-and-drop it onto the Size tab.\r\n\r\nNext, we go to the right hand panel where we find the “AGG(First or Last)” distribution pane; we right-click on the False legend, and select “Hide”\r\n\r\nThis way, we should see the lines taking shape, with only two columns, one for the starting year, and one the ending. With this, we would also want viewers to be able to change the start and end year.\r\nStep 3.3 - Time Filter\r\nAnd that brings us to the creation of a Time filter.\r\nWe first drag-and-drop the Event Date variable onto the Filter pane. A pop-up will appear - we select “Years” from the option list (this is just for place-holding, we will change it to month later below, with explanations)\r\n\r\nFollowed by checking the “Use all” option under the General tab, then click Ok.\r\n\r\nWe notice that the Year pill under the Filter pane is a dimension (blue pill). We click on the small triangle at the right-end of the blue pill, a list will pop up - we then select the date Month option as shown. Recall in earlier discussion in Section B, there is a need for more specific temporal filter to analyze changes for particular period of interest (e.g. from June 2016 onwards in the Philippines for President Duderte’s term), hence, while we change the filter date type, we also change to allow more in-depth, per-month analysis (instead of leaving it as Year). The pill should turn green in color.\r\n\r\nA window will pop up, and we select the “Range of dates” option, leaving all the other settings unchanged.\r\n\r\nLastly, we click on the triangle at the right-end of the pill (this time green) again - check on “Show Filter”\r\n\r\nStep 3.4 - Aesthetic Enhancement\r\nEntire View\r\nFirst thing first, we change the view to “Entire View”\r\n\r\nChart Labels\r\nNext, we add in labels on both end of the line to enhance clarity. We click on the Label tab, then select “Line Ends” as the option (see below), unchecking the “Allow labels to overlap other marks” option, and make sure the option for both “Label start of line” and “Label end of line” are checked.\r\n\r\nWe also want to edit the label to let the country and numbers be in one line\r\n\r\nDirection\r\nWe make use of colors to make the direction of change more obvious. Drag-and-drop the Direction variable into the Color tab\r\n\r\nDouble-click on the AGG(Direction) legend pane to edit the color - we want blue to denote decrease (since decrease in conflict event or fatality is good), while red to denote increase in the unfortunate numbers. We select the Blue-Red-Brown palette, then make the appropriate changes. “Not Applicable” in this case denotes countries where either the start or the end year data is not found (and hence we cannot visualize the change between the two years)\r\n\r\nTitle Labels\r\nWe hide the field labels for columns by right clicking the lable (“Event Date”), then selecting the “Hide Field Labels for Columns” option\r\n\r\nNext, we edit the y-axis title by right-clicking on the axis title, then selecting “Edit Axis”, the screen below will pop up - amend the title to “Total Number” while keeping the other settings unchanged\r\n\r\nTitle\r\nNext, we change the title to something more accurate by double-clicking on the viz title, and changing it to the following:\r\n\r\nStep 3.5 - Tooltip\r\nAnd finally, we include Tooltip by clicking on the Tooltip tab and making the changes as follows (all variables needed should already be within the original Tooltip):\r\n\r\nStep 3.6 - Reducing Non-Data Ink\r\nAnd before we go, we make an effort to reduce the non-data ink. Since we have the label for the count/fatality numbers, we do not really need the axes and the accompanying gridlines. We can proceed to remove them. Firstly, for the axes, we right-click on it, and uncheck the “Show Header” option\r\n\r\nNext, we also remove the gridlines. First by right-clicking on the viz, then select the “Format” option - the left panel will change. Select the icon for gridlines, then change the Grid Lines and Zero Lines under the Rows pane to be None.\r\n\r\nWe now have the final Slopegraph!\r\n\r\nPart 4 - Interactive Dashboard\r\nStep 4.1 - Linking Filters\r\nBefore we even create the Dashboard, we would need to link up the various filters across the two different sheets in order for the filters to apply across viz from from sheets.\r\nAt the Temporal Slopegraph sheet, click on the small triangle on the top-right corner of the Year filter pane. Select the option “Apply to Worksheets”, then choose “Selected Worksheets…”\r\n\r\nNext, check the other worksheet (in this case, “Geospatial”), in order for this filter to also apply to the geospatial dot density map viz. \r\n\r\nSimilarly, we return to the Geospatial Worksheet and do the same to the Actors, Country, and Event Type filters.\r\n\r\nStep 4.2 - Creating Dashboard\r\nNow we commence with the creation of Dashboard by first clicking on the “New Dashboard” button at the botton of the viz (beside the Worksheet tabs).\r\n\r\nThen drag-and-drop both the Worksheets onto the canvas\r\n\r\nChange the Size from the default “Fixed Size” to “Automatic”\r\n\r\nRearrange the Filters and Parameters as such:\r\n\r\nAmend the filter and legend to enhance clarity. For the Month and Year filter:\r\n\r\nFor the geospatial map color legend for event type:\r\n\r\nFor the temporal slope graph color legend for direction of change:\r\n\r\nAdd in Action to interlink the two sheets. First click on the Dashboard tab at the toolbar, then select “Actions…”\r\n\r\nAt the popped up window, select “Add Action >” then choose “Highlight”. At the Add Highlight Action window, make sure both sheets are selected for both the Source Sheets pane and the Target Sheets pane. Run action on “Select” then click OK\r\n\r\nWe check that when the slope line for Myanmar on the temporal viz is selected, only dots in Myanmar are highlighted to confirm the action is working. The converse is also true - when a dot in Myanmar is selected, only the Myanmar slope line should be highlighted.\r\n\r\nTo bring it a step further, we now want the dots to zoom in on a particular country when we click on one of the slope line. To do this, we click on the Slopegraph Worksheet, and then select the funnel icon to use the temporal viz Worksheet as Filter.\r\n\r\nAnd with that, we have the finalized visualization!\r\n\r\nSection E: Observations\r\nObservation 1 - Protests are everywhere within the region, but Battles are the most deadly\r\nFrom the geospatial map, one key observation is that Protests (in red colors) are dotted around the region with almost every country visible having some red dots somewhere within its boundaries.\r\nProtests are generally peaceful with no (or very few) casualties as evident in the small dots and verified by hovering over the dots to look at the fatality numbers.\r\nOne visible exception, though, is the military crackdown on ethnic Hmong Christians in Dien Bein, Vietnam on 5 May 2011, where 28 protesters were killed (and hundreds missing).\r\n\r\nBattles (in blue dots), on the other hand, are less widely-spread within the region, and is more commonly-seen in only Myanmar and the Philippines in the last decade. However, dots representing battles are visibly much bigger in size than any other colors (Event Types) - that is, many of these individual battle events are very deadly.\r\nEven while the battle events concentrates only in Myanmar and the Philippines, there appears to be some difference in their deadliness - blue dots in Myanmar are visibly much bigger than those in the Philippines.\r\nOne of the biggest blue dots (i.e. battle event) in the Philippines saw 39 fatalities reported resulting from a clash between rebel group Abu Sayyaf and the state force.\r\n\r\nOn the other hand, the two deadliest battle events in Myanmar (one in Kayin in Jan 2011, the other in Sagaing in Jun 2015) both lead to 115 estimated deaths each.\r\n\r\n\r\nThe single most deadly event in the past decade within the region, though, is an infamous Violence against Civilian event (yellow dot), that saw 243 fatalities during Myanmar military and police force’s killing of Rohinya villagers in the Rakhine state on 28 August 2017.\r\n\r\nThere also appears to an anomalously large blue dot in Southern Thailand (see figure above), however, on closer examination, this “dot” is actually formed by numerous smaller but highly concentrated blue and yellow (Violence against Civilians) within the southern Thailand states.\r\n\r\nWhile dot density provides a nifty overview of the geographical spread, there is definitely still a need for viewers to conduct due diligence to explore the visualization to make sure they are not misinterpreting what they appear to be seeing.\r\nObservation 2 -\r\nObservation 3 -\r\nAdditional Comments\r\nAnnex - Animating Changes on Geospatial Map\r\nAs mentioned in Section B on the further discussion on “Animating Changes on Geospatial Visualization”, the costs to animating the geospatial viz in the context of this dataset outweighs its benefits, and we will not be incorporating animation for the purpose of the makeover. However, should reader be interested, animation can be added rather easily in Tableau as the steps are straight forward.\r\nFirst, we drag-and-drop the Event Date variable onto the Pages tab\r\n\r\nNext, go to the Format tab on the tool bar, select “Animation” from the drop-down, then turn Workbook Default “On”. Change the Duration to “0.50 seconds (Medium)” and Style to “Sequential” if not already done\r\n\r\nFinally, we head to the Dashboard and confirm that the animation is on by clicking on the Format tab on the Toolbar, selecting “Animations…” then check that it is on “On”\r\n\r\nDo note, though, that this method would also mean the viz is unable to show the full decade long data altogether (as each year is now a page on its own that is being automatically flipped by Tableau via the animation).\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-03-20T17:33:31+08:00",
    "input_file": "dataviz-makeover-3.utf8.md"
  },
  {
    "path": "posts/2021-02-06-dataviz-makeover-2/",
    "title": "ISSS608 DataViz Makeover 2",
    "description": "This post presents a critical review, recommendations, and makeover of a visualization using data obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github\n\nThis post constitutes part of the assessment for credit towards the Singapore Management Univerisity module ISSS608 Visual Analytics and Application, AY2020/2021 Term 2. \n\nFinal redesigned visualization can be found on this link: \n\nhttps://public.tableau.com/profile/jason.tey#!/vizhome/VizMakeover2_16133754027850/Dashboard",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSection A: Critique of Original Viz\r\nClarity\r\nAesthetic\r\n\r\nSection B: Suggested Improvement\r\nClarity\r\nAesthetic\r\nDiscussion on Likert Scale Visualization\r\nDiscussion on Visualization of Uncertainty\r\nMakeover Concept\r\n\r\nSection C: Redesigned Visualization\r\nSection D: Step-by-Step for Viz Makeover\r\nPart 1 - Data Preparation\r\nPart 2 - Creating Divergent Stacked Bar\r\nPart 3 - Creating Bar Chart to Include as ToolTip\r\nPart 4 - Visualizing Uncertainty\r\nPart 5 - Interactive Dashboard\r\n\r\nSection E: Observations\r\nObservation 1 - Austra-Asian countries are less eagar for vaccination\r\nObservation 2 - Smaller households without children appears to be more eagar for vaccination\r\nObservation 3 - Retirees are more pro-vaccination than other employment status, and males more than female\r\nAdditional Comments\r\n\r\n\r\nThe original visualization made use of data from the Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github, and is appended below:\r\n\r\nSection A: Critique of Original Viz\r\nThis section provides a critique of the original visualization and comments on both clarity and aesthetic aspects that could be further improved on. A total of 10 clarity issues and 8 aesthetic issues were identified.\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nIssue\r\nComments\r\n1\r\nTitle (of 100% Bar Chart)\r\nTitle asked a question with no obvious answer provided from the visualization - at a first glance, this title created more questions than answer - after looking at the viz, we are still unclear which country is more “pro-vaccine”. This is partly due to issue S/n 2 and S/n 3 discussed below.\r\n2\r\nSort Order (for 100% Bar Chart)\r\nThe main drawback of the visualization is the lack of meaningful sort (which is presented in an alphabetical order). In this case, viewers will need to visually seek out the country with the longest blue bar in order to make meaningful deduction (assuming only the blue bars are of interest to the viz-maker - which leads to the next issue)\r\n3\r\nMissing Survey Question\r\nThis is another major flaw of the visualization - there is no way of knowing what was the question that respondents strongly agree or disagree to even if we know what each color is referring to.\r\n4\r\nIncomplete Information on Data Representation\r\nThe legend does not give any description for the values 2 (orange), 3 (red), and 4 (light blue). It does not clearly reflect that the segments are ordinal (i.e. in order of any significance) and hence confusion on the interpretation of the viz.\r\n5\r\nMissing Definition for Survey Responses\r\nRelatedly, while the titular question asked which country is more pro-vaccination, there is no clear indication of which color segment constitutes the “pro-vaccine” population (i.e. should we count the orange bar? What about the red bar?).\r\n6\r\nAmbiguous Unit of Measure\r\n“% of Total Record” does not sufficiently explain what the base of the “%” is, and what constitutes the “Total Record” (which seems to be a variable name)\r\n7\r\nMeaningless Headers in Legend\r\nSimilar to Issue 4 above, “Vac 1” does not explain what question the response was for and is as meaningless as putting any random symbol. In fact, it creates even more confusion (especially since the actual survey question is no where in sight) - is the question asking whether respondents are willing to take only one (and not two) vaccine shots? Or perhaps, take it only after 1 year?\r\n8\r\nRedundancy of the Bar Chart on the Right\r\nAfter diving deeper into the viz, it not difficult to realize that the right-hand viz is a repetition of the blue bars in the left-hand viz (except it is sorted by length of the blue bar)\r\n9\r\nMisleading Viz without Uncertainty\r\nAs a survey response, it is unclear how certain the visualizer is in the data (in the sense of statistical certainty) - it would be more helpful if the viz is presented with the error margins for various confidence interval presented\r\n10\r\nMissing Sample Size Info\r\nIn similar vein to the issue above, It is not clear if all the country has equal number of respondents, which could present a biased viz using percentage information.\r\nAesthetic\r\nS/N\r\nIssue\r\nComments\r\n1\r\nNo Clear Color Transition\r\nColor chosen for the ordinal scale is arbitrary and does not show any reflect any meaningful representation of the response scale, nor do they aid in answering the titular question. In fact there is even a repetition of blue (dark for 1, light for 4) for responses that are very different\r\n2\r\nPlacement of Legend\r\nWhile the legend is applicable for both charts, it is more applicable for the visualization on the right. However, the placement of it on the right panel of the viz requires viewers to glaze across the right-hand viz to extract information (however limited it is) from the land-hand viz to the legend\r\n3\r\nInconsistent Order\r\nWhile both the left- and right-hand viz are sending similar message, the fact that they are sorted differently makes them aesthetically irritable (and no less confusing - as covered in S/n 2 in Clarity section above)\r\n4\r\nChoice of Viz\r\nUsing bar chart to depict percentage of population that strongly agree to vaccination takes up unnecessary data ink (in addition to being inefficient in depicting accurate info with uncertainty - as discussed in S/n 9 in Clarity section)\r\n5\r\nSloppy text\r\nUsing ‘%’ instead of spelling percentage out makes the viz unprofessional and reeks of sloppiness\r\n6\r\nImproper Spelling of Proper Noun\r\nThe issue above is exacerbated by the fact that country names are spelled without capitalizing the initial letter, as with the norm for proper nouns\r\n7\r\nTypo Error\r\nFurthermore, spelling mistakes (“vacinne”) were spotted in the most obvious location - the title\r\n8\r\nInconsistent Decimal Placing\r\nThe two visualizations also bore differing decimal points for the common X-axis\r\nSection B: Suggested Improvement\r\nThis section provides some suggested improvements that could be implemented to resolve issues discussed in Section A.\r\nClarity\r\nS/N\r\nIssue\r\nSuggested Improvements\r\n1\r\nTitle\r\nEnsure that a proper title that is reflective of the viz is given, If the title is providing answer to a question, the answer should be easily identified / obvious from the viz. Proper subtitle could also be given to provide more information on the viz (e.g. the original survey question that was asked, the year in which the survey was conducted etc.)\r\n2\r\nSort Order\r\nWhen there is an ordinal variable of interest (in this case, responses that are pro-vaccination) involved in the visualization, proper sorting of the variable of interest should be done in ascending or decscending order for ease of reference, especially in such cases where the categories does not have inherent rank/order (i.e. countries, as opposed to, say, age groups, which have inherent order).\r\n3\r\nMissing Survey Question\r\nWhile the survey has solicited responses on a multitude of vaccination-related questions, the viz appears to only present response to one particular question (and without even providing the question in the viz). The existing viz can be improved by firstly presenting the questions to which the responses are visualized, and secondly to allow interactive toggling of different questions to see how various countries responded differently for the different questions\r\n4\r\nIncomplete Information on Data Representation\r\nWhile the codebook itself does not specify the corresponding meaning for each of the value, common norm for similar 5-class Likert Scale survey response could be adopted (i.e. Strongly Agree, Agree, Neutral, Disagree, Strongly Disagree). At the very least, the viz should be consistent - if 2,3, and 4 are presented without qualitative description, the description for 1 and 5 should be removed as well.\r\n5\r\nMissing Definition for Survey Response\r\nIf there is no proper definition to define who are exactly “pro-vaccination”, viz-maker should make an effort to provide a definition to reduce ambiguity in the viz presented (one may argue that only those who strongly agree to the question that they will vaccinate themselves as “pro” vaccination, while others may argue that even those who sits on the fence, i.e. neutral, are not “anti” and hence pro-vaccination). As much as possible, the title should be non-controversial and presents matter-of-facts to prevent confusion.\r\n6\r\nAmbiguous Unit of Measure\r\nTo provide clarity on the data being presented, axes should clearly indicate the unit of measure and explain/present the base for which the measure is measuring - not simply leaving the auto-generated axis header with variable names as it is\r\n7\r\nMeaningless Headers in Legend\r\nHeader, if any, should be clear, and enhance the comprehension for the legend, not confusion. Otherwise, it might be better to do without any header\r\n8\r\nRedundancy of the Bar Chart on the Right\r\nAn additional chart should provide additional information and not just repeat what is already interpretable from another chart, even if it is to highlight certain aspect of the other chart (which could be achieved with other means). At the very least, the second viz should have a synchronised axis with the first if they are presenting on similar data to prevent confusion.\r\n9\r\nMisleading Viz without Uncertainty\r\nA better improved version would be to plot an uncertainty visualization using dots-and-lines, with the dot representing proportion for the sub-population (in this case country), and lines (“wings”) extending out to reflect the uncertainty involved. This would give a more accurate depiction of the data presented without misleading with missing uncertainty information.\r\n10\r\nMissing Sample Size Info\r\nAdditional information could be included to provide a clearer broad picture of the data used (e.g. sample size, confidence interval for different confidence level) to give viewer a more informative and accurate understading of the data\r\n11\r\nAdditional Enhancement\r\nBeyond the improvements to be made in view of the issues discussed, the dataset provided also included various other questions that could be of relevance to answering the question of “which country is most pro-vaccine”, as well as having the potential to distill further insights from a demographical breakdown using an interactive visualization. Hence, relevant response results as well as socio-economic data could be incorporated as parameters or filters to allow deeper understanding of the data to better meet the objective of the viz.\r\nAesthetic\r\nS/N\r\nIssue\r\nSuggested Improvements\r\n1\r\nNo Clear Color Transition\r\nColor chosen for the ordinal scale should be reflective of the response (e.g. transit from darker/brigter to lighter/muted shades of the same color for differing degrees of response such as between Strongly Agree and Agree; and have contrasting color for positive and negative responses such as red for disagree and blue for agree in this case)\r\n2\r\nPlacement of Legend\r\nLegend should be positioned for ease of reference\r\n3\r\nInconsistent Order\r\nSorting conventions (e.g. for non-ordered/ranked categories, don’t have to keep to existing order, e,g, alphabetical, if the variable of interest has an ascending/descending order) should be followed for ease of reference and prevent aesthetically unpleasing jagged viz in the different colored bars\r\n4\r\nChoice of Viz\r\ndata ink should be optimised (while not losing clarity) as much as possible with good choice of visualization\r\n5\r\nSloppy text\r\nProper spelling of fucntions, names, and variabales should be used to present viz professionally\r\n6\r\nImproper Spelling of Proper Noun\r\nEfforts could be made to edit presentation and adopt proper English conventions for spelling\r\n7\r\nTypo Error\r\nTypo error should be avoided and vetting should be done before publishing\r\n8\r\nInconsistent Decimal Placing\r\nDecimal Placing should be consistent especially if similar data drawing from the same variable is being used\r\nDiscussion on Likert Scale Visualization\r\nThe visualization on the left is essentially a basic Likert Scale visualization using a 100% Stacked Bar. In what is now a classic debate in the data visualization realm, Stephen Few, in his 2016 blogpost, countered Cole Nussbaumer Knafic’s preference for a 100% Stacked Bars, and proposed alternative visualizations to achieve different objectives. He argued that \"variations on the design of 100% stacked bar graphs usually work better). For one, he recommended what is now known at Diverging Stacked Bars (negative values running left from zero and positive values running right from zero) with separate neutral bars. He argued that this allowed difference between positive and negative results to stand out more. For situations where neutral results are more appropriate to be incorporated in the same viz, he recommended for the results to run down the middle.\r\nThe proposals, especially the latter with neutral running down the middle, was met with resistance from Nussbaumer, expectantly. She argued that the neutral bars in the middle creates the illusion where results with long neutrals appear to be more positive than they really are, courtesy of a long neutral that pushes bars further in the positive and negative regions.\r\nNussbaumer was not the only one who disagreed. Lisa C. Rost & Gregor Aisch discussed two minor and one major shortcomings of the diverging stacked bars in their 2018 blogpost, in favour of the 100% stacked bar. Rost and Aisch argued based on the following three premises:\r\nThe total agree & disagree shares are more important than the individual values of ‘strongly agree’ and ’agree\r\nOpinions are more important than non-opinions (“people who are undecided are kind of boring”)\r\nIncluding neutral percentages in the final chart is important (“‘Don’t know’ is data”)\r\nBased on these premises, the authors argued that the divergent bar charts (1) loses intuitive understanding that parts within the stacked bars are shares, (2) is a waste of space, and (3) is hard to compare the length to either side of the middle line (and this is worse in the neutral-in-the-middle version). The authors also summarized the various viz options for Likert Scale data:\r\n\r\nThis was subsequently met with a response from Daniel Zvinca, who presented a solution with stronger views in the middle, advocating for a “butterfly-like” design, showing the most antagonist (i.e. strongest) values in the center. Daniel argued that this allows viewer to focus on what is most important (be it for policymakers or business owners to focus on who most agree/disagree with their product/service). He also argues that this solution addresses the weaknesses highlighted by Rost & Aisch.\r\nLastly, Daniel provided options for the treatment of the neutral values - depending on the target question in mind for the visualization to address, neutral bars can be split equally into two ends of the chart or to either end.\r\nBased on the series of discussion/debate above, it is clear that 100% stacked bars and diverging stacked bars each have their pros and cons. For the purpose of this dataviz makeover, where the objective is to present survey responses to reflect proportion of population that are supportive of the use of vaccine versus those who are not. In this simplified problem statement (i.e. a dichotomy between pro and non-pro vacccine population), the Diverging Stacked Bar is preferred. Daniel’s version of placing stronger opinions in the middle provides a clearer distinction between two opposing camps of opinion - exactly apt for this viz’s objective.\r\nIn the treatment of neutrals, the author of this viz makeover agrees strongly with the premises laid out by Rost and Aisch, including the fact that neutrals will need to be included (though they are boring). This is especially important when we move on the discussion next on biasness and uncertainty. Of course, considerations were also made on the space constraints to incorporate two charts in one viz (more on that in next section), and neutrals, bring no more special than other non-pro response in this case, does not warrant a separate column on its own for special attention. In line with the principle to display stronger views in the middle, neutrals (being the least “strong”) will be pushed to the sides. In consideration of the dichotomy nature, though, it would be more appropriate for the neutrals in this viz to be on the negative end of the chart (i.e. the non-“pro” end) - ultimately, sitting on the fence for an issue definitely does not qualify one as being “pro” towards the issue.\r\nA visualised concept of the proposed viz is presented by Daniel in his post and presented below:\r\n\r\nReferencing the summary table drawn up by Rost & Aisch, this version provides the advantages that a Stacked Bar Chart offers, preserves the 100% proportionality (i.e. all bars are of equal length summing to 100%), all while creating the contrast in the middle for visual distinction that is not present in the Stacked Bar Chart. Steve Wexler presents a step-by-step guide for the creation of a Diverging Stacked Bar, for which this viz references.\r\nDiscussion on Visualization of Uncertainty\r\nBecause of errors from random sampling, it is difficult to determine the exact value of the population mean from which the sample is drawn from using only information from the sample. However, it is possible to construct a set of values that contains the true mean with certain prespecified probability - this is referred to as the confidence interval. A 95% confidence interval, in lay terms, provides a range for which we are confident the true mean would fall within 95 times if we were to repeat the sampling 100 times.\r\nWhen discussing survey response, it is critical to present the results with the uncertainty that comes along with sampling, lest we mislead viewers into thinking the sample results are definitive in representing the population at-large, and conclude more than the data allows. Visualization of uncertainty is also critical when we have different sample sizes across the categories we are comparing, and especially so for sub-categories where the sample sizes are small (and hence uncertainty are correspondingly huge) - without visualizing the uncertainty, viewers will be misled into concluding something based on only a small sample.\r\nNicole Torres discussed the difficulty in visualizing this uncertainty in a 2016 article - attributing the difficulty in the abstract nature of the uncertainty (Torres went on to also discuss the issue of interpretation - e.g. given a 90% chance of an event happening, even if it does not happen, it does not mean the prediction/viz is wrong; the unlikely just happened. But this is outside the scope of this blog post). Claus O. Wilke discussed this problem on the visualization of uncertainty in Chapter 16 of his book - Fundamentals of Data Visualization. In visualizing the uncertainty of point estimates (as is the case we want to make in this viz, for the proportion of respondents who are pro-vaccination - or whichever question is asked), Wilke presented several options, each with an identified strengths and weaknesses. Wilke explained that error bars with cap highlight the existence of different ranges corresponding to different confidence levels, but adds on visual noise.\r\n\r\nSteve Wexler, in another step-bystep guide in the visualization of error bars in Tableau, referencing Ben Jones’ book Communicating Data with Tableau. In this blogpost/guide, Wexler advocated for the dot-with-dual-error bars viz, while providing his comments to this eventual choice\r\n\r\nWexler echoed Milke’s concerns that a cap line (‘whiskers’ at the end) gets too much attention than the dot and error lines themselves. He also presented a ‘fingernail’ chart, which he confessed to be ugly; a gradient bar for the confidence interval, which are cool but distracting; as well as a Gnatt error bars, which are similarly stole the limelight from the main dot point estimate.\r\nWexler concurred with Sönning’s views in his paper that prominent elements should receive more attention and hence decided on the final dot-with-error-bars (without whiskers) that we see above. The author of this visualization agrees with the need to ensure salient figures are given the attention they require and to reduce distractions to viewers. Wexlex’s step-by-step guide, as well as the Tableau workbook enbeded within, were used for the visualization of the dot-with-error-bars viz for this post.\r\nMakeover Concept\r\nTaking in the points discussed above, a redesigned visualization could look like the following:\r\n\r\nAddressing Clarity Issue\r\nS/N\r\nIssue\r\nWays in which proposed viz resolve issues identified\r\n1\r\nTitle\r\nThis new viz provides clear title of what the question is asking, as well as some of the key info in the subtitle\r\n2\r\nSort Order\r\nA much interpretable viz with the countries having positive responses immediately identified with both charts\r\n3\r\nMissing Survey Question\r\nSurvey questions is included in prominence\r\n4\r\nIncomplete Information on Data Representation\r\nClear information provided on what each color means with proper placement of response value\r\n5\r\nMissing Definition for Survey Response\r\n“Pro-vaccine” vs those who are not are clearly segregated into two sides of the “y-axis” to provide visual dichotomy to address the the objective of the viz - i.e. which country is more pro-vaccine.\r\n6\r\nAmbiguous Unit of Measure\r\nProper display on unit of measure to reduce ambiguity\r\n7\r\nMeaningless Headers in Legend\r\nSince the responses are intiutive when presented together with the survey question as the title, a header is redundant and removed\r\n8\r\nRedundancy of the Bar Chart on the Right\r\nViz on the right is revamped to showcase the uncertainty involved in presenting the “pro” vaccination response, and hence, a different dimension to the viz with additional information - it is no longer redundant\r\n9\r\nMisleading Viz without Uncertainty\r\nViz on the right has addressed this issue to enhance clarity and accuracy\r\n10\r\nMissing Sample Size Info\r\nSample size info is provided for viewers to make informed deduction on the proportion of pro-vaccinators, where longer uncertainty error bars gives raises the alert for viewer to be cautious, and the records number provides another point of reference to pick out any red-flags.\r\n11\r\nAdditional Enhancement\r\nEnhancement in the form of filters and parameters to narrow down into particular sub-population is also added - this makes use of the inherent strength of tableau - allow user-friendly dashboards for users to toggle and explore the dataset to its full potential. Lastly, the visualizations are also optimized to tailor to the objective in mind, as discussed in the sub-segment above.\r\nAddressing Aethetic Issue\r\nS/N\r\nIssue\r\nWays in which proposed viz resolve issues identified\r\n1\r\nNo Clear Color Transition\r\nProper color transition and contrasts are incorporated to emphasize the distinction between those who are “pro” and those who are not, as well as to provide greater focus on stronger opinions.\r\n2\r\nPlacement of Legend\r\nLegend is placed at position easy for reference\r\n3\r\nInconsistent Order\r\nBars are sorted to enhance clarity as well as in a visually-pleasant manner\r\n4\r\nChoice of Viz\r\ndata ink are optimized with the choice of viz that best presents the data while preserving (or even enhancing) clarity\r\n5\r\nEditorial Issues\r\nProper spelling of functions, names, and variables are used; English conventions adopted; typo vetted against; and consistency in formatting are in placed to ensure professionalism\r\nSection C: Redesigned Visualization\r\nUsing Tableau, the redesigned visualization based on the discussion points and concept presented in Section B above is created as follows:\r\n\r\nThe redesigned visualization can also be accessed via this link\r\n\r\n\r\n\r\nSection D: Step-by-Step for Viz Makeover\r\nThis section provides a step-by-step guide to recreate the redesgined visualization.\r\nPart 1 - Data Preparation\r\nStep 1.1 - Download and Import Data\r\nFirst, download the data files used via this link to the Imperial College London YouGov Covid-19 Behaviour Tracker Data Hub.\r\nAs the data files are separated by the various countries for which the surveys are conducted, with some being zipped up in zip folders, we will next need to unzip these files. For the ease of data retrieval later on, we will store all the country files to be used in one common folder.\r\n\r\nThereafter, open Tableau Prep Builder to prepare for the data wrangling process.\r\nStep 1.2 - Importing Mulitple CSV files\r\nDrag-and-Drop one of the country file to be used onto the home page of Tableau Prep Builder. Under the ‘Input’ panel, select ‘Muiltple Files’, click on ‘Wildcard union’, then search in the folder where all the country files to be used are stored. Click ‘Apply’\r\n\r\nStep 1.3 - Filtering Relevant Data\r\nOnce all the datasets are joined, uncheck all fields then check on the box of the following relevant fields to select them for retention:\r\nVac_1, vac2_1, vac2_2, vac2_3, vac2_6, vac_3\r\nendtime\r\ngender\r\nage\r\nemployment_status, employment_status_1 through employment_status_7\r\nhousehold_size, household_children\r\nFile paths\r\nOnce that has been applied, we next filter the data to focus on records from Year 2021: click on the ‘Filter Value’ tab, and input the following calculation, then click Apply and Save\r\n\r\nStep 1.4 - Data Issue: Pivoted Employment Fields\r\nThere are numerous data issue with the employment_status fields. Most obviously, Nordic countries Sweden, Denmark, Norway and Finland actually pivoted the employment_status field to form 7 different columns for each of the responses. The real problem, however, is that there are overlaps in positive responses to the 7 columns (i.e. they are not mutually exclusive - respondents could answer “Yes” to multiple employment status).\r\nTo resolve this issue, priority has to be devised to accord one prevailing status for rows with multiple Yes’s to the employment status. In this visualization, full-time employment will take precedence over any other status (i.e. if a respondent answers Yes to full-time employment, he/she will be recorded as having full-time employment under a recoded employment status column). Next piority, in order, will be for full-time student, then part-time employment (other status has no overlaps). The above logical recoding of the employment status field can be achieved by creating the following calculated field:\r\n\r\nStep 1.5 - Renaming Fields and Values\r\nNext, we rename the File Path variable to ‘Countries’, remove the ‘.csv’ at the end of each entry, then capitalize the country name for proper spelling of country names.\r\n\r\nFor the Household Size and Household Children fields we regroup all categories 8 and above as ‘8 or More’. ‘Don’t know’ and ‘Prefer not to say’ entries are recoded as null.\r\nStep 1.6 - Output Data\r\nFinally, include an Output node on the Prep Building flow\r\n\r\nOutput the cleaned data as a csv file back to the folder where the datasets were stored, with the following options:\r\n\r\nPart 2 - Creating Divergent Stacked Bar\r\nStep 2.1 - Importing Data & Assigning Variable Types\r\nFirst, open Tableau then import the merged and cleaned dataset by drag-and-dropping it onto the main page.\r\nTableau automatically assigns variables with integer values as Measures - this is not accurate for our survey response variables where 1 represents ‘Strongly Agree’ and 5 ‘Strongly Disagree’. Hence, we shift these vac_x variables from the Measures section to the Dimension section\r\n\r\nStep 2.2 - Creating Variables for Stacked Bar\r\nWe start by assigning 1 to all entry and call it ‘No. Record’ - this will come in handy when we calculate the survey entries. Go to the “Analysis” tab at the top of the page, click on “Create Calculated Field…”, then input the following name and formula:\r\n\r\nNext, we sum up the records count by creating the following new calculated field following the same steps as above:\r\n\r\nWe will need a Parameter to toggle between the different questions we have included in the viz, soliciting user to select a question of interest. - Right click on an empty spot in the Data panel, select “Create Parameter…” from the list of options. - Rename the Parameter to “Select Question” - Data type as String - Check on “List” for “Allowable values” - Input the corresponding variable name for the different vaccination-related survey question that we have chosen to retain, then key in their corresponding full question under “Display As”.\r\n\r\nThe Parameter will then need to be “activated” to trigger response to the viz: create a new calculated field (“Question Selected”) using the CASE function as below - when a parameter is selected, the corresponding “vac_x” variable will be called into view:\r\n\r\nNext, we want to survey responses which are more than 2 (neutral, disagree, strongly disagree) to bear a weight of 1 for a variable called ‘Count Negative’ - this will allow these (non-“pro”) responses to start from left of the middle origin y-axis divider later.\r\n\r\nSum up this variable across the table in the variable ‘Total Count Negative’\r\n\r\nNext, we need the Percentage of responses that selected each response foe the selected question (Strongly Agree, Agree, etc.), out of the total record\r\n\r\nAnd because the divergent bars are ultimately a Gantt chart, we will need a variable to tell the individual response value where to start - by dividing the Total Count Negative by the sum of Total Count (with a negative in front), we will be able to identify where the values bigger than 2 (i.e. neutral, disagree, strongly disagree) will start from the left of the y-axis (note the negative sign at the beginning of the formula below for the variable Gantt Start).\r\n\r\nThe final variable to create for the basic stacked bars is a little more tricky - we need a variable to tell us how long the bar for each response should be when stacked together. We first find where the bar starts, then add the percentage of the next row, skipping null values (note: up to this step, Tableau will compute this across table, later on we will specify for it to compute using each responded value, together with Gantt Start, Gantt Percent will then start where the previous response value ends, then add all entries with that response value together, then restart for each response value)\r\n\r\nStep 2.3 - Divergent Stacked Bar\r\nNow we put everything together. We drag-and-drop Countries to Rows, Gnatt Percent to Columns, change the chart type to Gnatt Bar, drop Question Selected to Colour and another one to Detail, and finally Percentage to Size\r\n\r\nThereafter, we go to the little triangle on the green Gnatt Percent pill, ‘Compute Using’ option, and select ‘Question Selected’. Do the same for the green Percentage pill under Size.\r\n\r\nUnder Colour, click on ‘Edit Colors…’, select dark blue for 1, light blue for 2, muted neutral color for 3, light pink for 4, and bright red for 5. Right-click on the Question Selected blue pill under colour, and select ‘Sort’. Under ‘Sort By’, choose Manual, and arrange then in 3>4>5>1>2 order (based on conclusion from Section B, we want to put the stronger views in the middle, with neutral at the end of the “non-pro” side)\r\n\r\nAnd there, a basic Divergent Stacked Bar is created! One last touch - to change the negative percentage on the left of Y-axis to positive. Right-click on the X-axis, select Format, under Scale, Numbers, choose ‘Custom’ and type ‘0%;0%’ as the format\r\n\r\nStep 2.4 - Sort Viz\r\nWe want to create a sorting variable (which will also be used in the following portion of our viz) to calculate percentage of respondents who provided positive response to the questions asked (i.e. either Strongly Agree or Agree). But first, we need to sum up all the positive responses with a new ‘Value’ field\r\n\r\nThen divide this value by the number of records to get the percentage of positive responses- “Pro Percent”\r\n\r\nAnd finally, we can go back to the blue Country pill under Rows, right-click and select ‘Sort’, select ‘Field’ under ‘Sort By’, Descending order, ‘Pro Percent’ under Field Name, and leave Custom as the Aggregation.\r\n\r\nPart 3 - Creating Bar Chart to Include as ToolTip\r\nStep 3.1 - Creating Bar Chart\r\nFirst, create a new Worksheet on Tableau. Before we do anything further, we create a new variable - ‘Ranked Response’ - to transform the 1-5 code into actual description of the response (e.g. Strongly Agree etc.)\r\n\r\nNext, at the new Worksheet, we drag-and-drop No. Record onto Columns, and Ranked Response onto Rows and Color box, then Percentage into Label box. Change the color of the viz using the ‘Pick Screen Color’ option to ensure consistency on the color bar with the main viz. Manually sort the order of the Y-axis to start from Strongly Agree to Strongly Disagree.\r\nNote: When presented as a bar char instead of a diverging stacked bar, it would be more intuitive to transit from strongly positive response to strongly negative ones, since we are not trying to depict a dichotomy/contrast here, but merely to provide additional information of viewers to make visual comparison of the country-wide response. Hence this order instead of aligning with the main viz’s order\r\n\r\nStep 3.2 - ToopTip linking sheets\r\nWe head back to the Divergent Stacked Bar sheet. We create one variable Percentage Response that multiplies 100 to the variable Percentage (this will make the ToolTip information more easily interpretable as a percentage of response). Include this new variable, together with Ranked Response into ToolTop box, and input the following into ToolTip\r\n\r\nHowever, we notice that the Ranked Response does not change color when we hover over each of the different ranked responses. Hence, to improve it even further, we create another 5 separate variable to create to color changing effect\r\n\r\nThe above uses Strongly Agree as an example, the process is repeated to create 4 other variables for the four other response value. Next, put all 5 newly created variable into ToolTip\r\n\r\nFinally, edit the ToolTip as follows:\r\n\r\nAnd the complete Stacked Bar Chart with informative summary and ToolTip showing overall survey response from the country is created!\r\n\r\nPart 4 - Visualizing Uncertainty\r\nStep 4.1 - Creating Variables Required\r\nWe have created two important variables earlier (Value and Pro Percent). Next, we will need a few more variables that measure uncertainty. Starting with the Standard Error\r\n\r\nZ-scores \r\nError Margins \r\n95% Bounds \r\n99% Bounds \r\nConfidence Intervals \r\nA Parameter to allow toggling between 95% and 99% CI, both, or none to be shown. Select ‘String’ as the Data type, List for Allowable values, and the values and displays as follows \r\nUpper and Lower Bounds for the two different confidence level \r\nAnd one final variable to display the absolute percentage point of uncertainty from the estimated proportion - the Confidence Interval, which will show 99% CI for all cases except when only 95% CI is chosen for the parameter. \r\nStep 4.2 - Creating Basic Uncertainty Viz\r\nFirst, drag-and-drop Countries onto Rows and Pro Percent onto Column\r\n\r\nNext, drag-and-drop Measure Values onto Columns; a list of variables will appear on the Measure Value panel to the left of the viz, remove all except the four upper/lower bounds for 95%/99% CI (as shown below). On the Measure Value green pill under Columns, right-click and select Dual Axis,\r\n\r\nOn the Measure Values tab under the Marks panel, select Line as the chart type, then drag-and-drop the blue Measure Names pill from Detail to Path. Click on Color to change it to a grey color to distinguish from the dotted mean, and reduce the size of the lines.\r\n\r\nRight-click on the top Axis to select Synchronize Axis, then uncheck Show Header to turn it off.\r\n\r\nSort the Y-axis by descending Pro Percent (as with earlier Divergent Stacked Bar viz to synchronize)\r\n\r\nOn the AGG(Pro Percent) tab under the Marks panel, drag-and-drop Pro Percent to Label; edit the labels to a smaller font (6pt) and ensure the format is Percentage (no decimal point). Formating can be done by right-clicking on the green Pro Percent pill under Label and selecting “format”. Similarly, X-axis should also be in Percentage format, and formating can be done by right-clicking and selecting ‘format’ as well (Under the Axis pane, go to ‘Scale’ segment, under ‘Numbers’, select ‘Percentage’). Right click on the X-axis and select ‘Move marks to front’ if not already at the front.\r\n\r\nSelect Entire View on the view option. Drag-and-drop both the ‘CI %-pt (+/-)’ and ‘No. Record’ variable onto Rows, then click on both the pills to change them from Continuous to Discrete (see below). Format the ‘CI %-pt (+/-)’ rows to retain 4 decimal points.\r\n\r\nNext, we allow the error bars to change according to the CI we have selected. First, drag-and-drop Measure Names into both Color and Size.\r\n\r\nWe then adjust the color of the bar to let 95% CIs (which are shorter) be of a darker grey, and 99% CIs be of a lighter grey - Double click on the color palette on the right under the header “Measure Names” then select the desired color (using the Seattle Grays palette makes life easier - just choose two from the 50 shades of gray…)\r\n\r\nNext, edit the sizes of the data information (by right-clicking the relevant areas and selecting ‘format’ to change the sizes, generally to size 7), reduce data ink (row dividers were removed to reduce data ink, this can be achieved by right clicking the via area, selecting ‘format’, under the Border tab, under Rows, select None for Pane), and change the axis title (see below) to “Percentage of respondents who answered Agree or Strongly Agree (%)”. And there we have our basic uncertainty viz\r\n\r\nStep 4.3 - ToolTip\r\nWe include a ToolTip to summarize the data points when hovered over. Before that, we create an extra variable showing the country’s mean percentage who responded positively to the selected question - “Country Pro Percent” - this will come in useful when we add on filters to allow toggling into sub-populations (see next step). With this Country Pro Percent, we would then be able to compare the sub-population’s positive response rate vis-a-vis the country’s average.\r\n\r\nFinally, we add on the ToolTip by clicking on the ToolTip box, where an editing box will pop up, and input as shown below\r\n\r\nStep 4.4 - Filters\r\nBefore we put everything together, let’s create one more filter - Age Group - by creating a new calculated field as follows.\r\n\r\nWe then drag-and-drop Gender, Age Group, Employment Status, Household Size, and Household Children onto the Filter panel, show all the filters. To optimize space, we will change Gender to single value drop-down, while the rest of the filters to multiple-values drop-down. Find the two Parameters on the Parameters panel on the bottom-left, and show both the Select Question and CI parameters as well.\r\n\r\nFor each of the filter, we click on the small triangle beside them, go to ‘Apply to Worksheet’, select ‘Selected Worksheet’ and check the box beside ‘Divergent Stacked Bar’ sheet. \r\nAnd there we have it, the final Visualization for Uncertainty with informative ToolTip. While the lines for the standard error margins are small in this version, it will be more obvious when we explore sub-population of each country by filtering down the dataset, which will lead to smaller number of records being available.\r\n\r\nPart 5 - Interactive Dashboard\r\nStep 5.1 - Basic Dashboard\r\nPutting them altogether is easy: first, drag-and-drop both the Worksheets onto an empty Dashboard: Diverging Stacked Bars worksheet first, then the Uncertainty sheet to the right, the parameters/filters will be automatically attached.\r\n\r\nNext, reconfigure the parameters and filters to go to the top of the page by shifting them around. Next, add in a Text Tiled object on top of the parameters and filters to input the title and subtitle. Lastly, change the Size to ‘Automatic’\r\n\r\nStep 5.2 - Final Dashboard with Action\r\nFinal step for this visualization is to add Actions: go to the Dashboard tab on the top, click on ‘Actions…’. Click on Add Action, then Highlight, and connect both sheets on the Dashboard with both sheets, running action on select.\r\n\r\nAnd there we have it - the final dashboard!\r\n\r\nStep 5.3 - Upload\r\nAnd once all is done, we upload the viz onto Tableau Public\r\n\r\nThis Visualization is made available on Tableau Public via this link\r\nSection E: Observations\r\nObservation 1 - Austra-Asian countries are less eagar for vaccination\r\n\r\nWhen asked to respond to the question: “if Covid-19 vaccuibe were available this week, I would definitely get it”, Australia and the three Asian countries (South Korea, Japan, Singapore) generally answered less favorably as compared to the other countries. In fact, more respondents were non-pro than pro-vaccination (pro-vaccination being defined as those who answered “Strongly Agree” or “Agree” to the subject survey question) - with the pro-vaccination proportion of the sample being only between 35-44%.\r\n\r\nOf course, on closer examination, this is mainly attributable to these countries having some of the most undecided group of people among those presented - around one in four respondents selected “3” (representing “Neutral”) on the ranked scale for this question. Even discounting the neutral group, these four countries also have the least “strong” opinions - that is, they have the least “Strongly Agree” and “Strongly Disagree” responses.\r\n\r\nResponses are slightly more “positive” when we consider a one-year time-frame, i.e. when answering the question, “If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it”, with the “pro” proportion to this question for the four countries around 48-57%. While one could proposition could be that these countries are less afraid of the virus…\r\n\r\nThe data seems to show otherwise. Only Australia seems to be rational to this fact - that they are not as worried about the virus as compared to the other country population and hence have less urgency in wanting the vaccine. The Asian countries, though, seems to contradict this postulation: why, then, do the three Asian countries sit on the fence while being worried about the virus? The answer lies in the following:\r\n\r\nWhile worried about the virus, the Asian respondents are also skeptical about the vaccine and its side effects. This might partially help explain why some of those who are hesitant to take the vaccine immediately, are more receptive to it one year later - perhaps the reasoning is to allow more clinical findings on the side effects, before they are sure of the vaccine. And before we conclude that this could be due to cultural influence, we should also note that France, as an anomaly vis-a-vis other Western countries, also exhibit similar, if not more extreme (less on the fence, more strong views on “anti” vaccine than pro), responses.\r\nNote: another proposition could be that death rates are lower in the Asian countries and France as compared to the other countries, and hence the respondents from these countries are not as worried. However, a cross-reference to the death rates by country disproofs this theory - while Singapore indeed has one of the lowest death rates due to Covid-19, Franch has a high total number of death (7th gloablly) and death rate (22nd globally), while Japan’s total death also ranked at 37th globally.\r\nAs an added nugget of wisdom - it appears that Singaporeans, while skeptical of the vaccine, have good faith in its government (the other countries skeptical about the vaccine, not so much):\r\n\r\nObservation 2 - Smaller households without children appears to be more eagar for vaccination\r\n\r\nWhen the dataset is further filtered down to include only respondents with no children in household and has a household size of 1 or 2, it can be observed that this sub-sample population are more “pro” vaccine than the national averages. In the above example using Denmark, we see that 73% of these small-households-without-children respondents responded positively to the qustion on whether they would get the vaccine if it was available this week, which is about 7 percentage points higher than the country mean of around 66%. This observation, in fact, is observed across all country in the dataset. This is similarly observed across all countries (i.e. small-household-without-children are more pro than national average) when we change the question to ask about respondent’s opinion if vaccines were available one year from now.\r\n\r\nSomewhat intuitively, this small-household-without-children group are also more worried about the virus. But who exactly are these small household respondents who are so worried and eagar for vaccine though - are they young single or recently-married adults without kids, or the old elderly couples staying away from their children?\r\n\r\nFirst, we examine those less than 40 years old within this sub-population of small-household-without-children. We notice that their “pro” proportions are not as high as the country mean - take Denmark for example, this group has 56%, as compared to the national average of 66%. This is generally observed for all the other countries, except United Kingdom - which we should take with a pinch of salt as the number of sample records available for this sub-population is only 25 (similarly, Singapore’s data as well, since there are only 15 data points in this instance).\r\n\r\nIndeed, across all countries examined those 60 years and older within the small-household-without-children are much more pro-vaccination than the national average. Taking Denmark’s as example, those who fall under this sub-category are almost 20%-pt higher in their “Agree” and “Strongly Agree” responses as compared to the country’s mean. This big difference is observed across all countries. What is notable as well is that the number of respondents 60 years and older is much more than the number for respondents younger than 40 years old (except for UK, Australia, and S. Korea). This would mean that the older population’s opinion would have a larger weight in the country mean.\r\n\r\nIndeed, household sizes and number of children, while affects the eagarness to get vaccinated, a larger underlying factor could be due to the fact that older respondents above the age of 60 are more eagar to get vaccinated and many of these older respondents interviewed happened to be living in smaller households without children. So while at the first glance it appears as if smaller households without children are more eagar for vaccination, as we saw with the younger group of small-household-without-children, they are no more keen to take vaccination than the general masses, and a more appropriate title for this observation should be “older respondents above the age of 60 are more eagar to get vaccinated”. This brings out an interesting point - what may appear to be the truth may not depict the full picture (even though it is not lying)!\r\nObservation 3 - Retirees are more pro-vaccination than other employment status, and males more than female\r\n\r\nIn a somewhat parallel comparison, we noted that the results are rather consistent when we narrow down to look at the response from “Retirees” across the countries. Looking at Denmark for example, the 86% pro-vaccination proportion coincides with the proportion for those older respondents above age 60 that we see above (although the number of records are small now, with about 160 older respondents who are not retired yet). This is similarly observed throughout the countries. When we look at every other groups by employment status, they are mostly less pro-vaccination than the country’s mean (again, this is due to the retirees pulling their weight in the response count).\r\n\r\nNor surprisingly, this group also are must more worried about the virus than the general masses. However, only a smaller proportion are worried (e.g. Denmark’s 54%) as compared to those who would get vaccinated if available now (86%) - that is, many would get vaccinated, despite not being worried.\r\n\r\nNext we switch to look at the split between males and females: in general, males are typically slightly more pro-vaccine than their female counterparts (except in Sweden).\r\nPutting them altogether, we can conclude that retired males above 60 years old without kids in their small 1-2 pax households are the most pro-vaccination sub-group.\r\n\r\nThis proportion goes up to as high as 90% in Denmark. Why not mention the 100% with UK that does not seem to have any uncertainty? With 2 similar records, the formula is unable to derive a meaninful uncertainty (no “deviation” at all!); looking at Australia, when you have a “perfect deviation”, things turned hay-wire - and this is why it is important to present uncertainty along with the main estimated proportions.\r\nAdditional Comments\r\nWhile the dataset provided a rich amount of information via the visualization done up, there are inherent biases and missing information present in the data.\r\nFirstly, there is an obvious missing of countries from certain regions, and a total disregard for the fact that these countries are well-to-do advanced economies. This could be due to a lack of data, but would be interesting to find out how well-perceived are the vaccines in other parts of the world in geographical and socio-economic terms.\r\nSecondly, given that vaccines are more readily-available in many countries today (and increasingly so), it would be intersting to see how the sentiment shifts with the greater prevalence of the vaccine (for further study, perhaps a time series plot of the response could be explored).\r\nAnd lastly, an inherent issue with the existing data: having a larger proportion of older respondent.This will need to be addressed in order to prevent skewing of data by the opinion of a particular sub-population\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T18:32:55+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-23-dataviz-makeover-1/",
    "title": "ISSS608 DataViz Makeover 1",
    "description": "This post presents a critical review, recommendations, and makeover of a visualization found in MOM's \"_Report: Labour Force in Singapore 2019_\". \n\nThis post constitutes part of the assessment for credit towards the Singapore Management Univerisity module ISSS608 Visual Analytics and Application, AY2020/2021 Term 2. \n\nFinal redesigned visualization can be found on this link: https://public.tableau.com/profile/jason.tey#!/vizhome/DataVizMakeover1_16115150979860/VizMakeover1",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSection A: Critique of Original VizClarity\r\nAesthetic\r\n\r\nSection B: Suggested ImprovementClarity\r\nAesthetic\r\nMakeover Concept\r\n\r\nSection C: Redesigned Visualization\r\nSection D: Step-by-Step for Viz Makeover\r\nSection E: Observations\r\n\r\nThe original visualization presented as Chart 6 on Page 22 of MOM’s Report: Labour Force in Singapore 2019 is reproduced below\r\n\r\n\r\n\r\nFigure 1: Original Visualization by MOM, Singapore\r\n\r\n\r\n\r\nSection A: Critique of Original Viz\r\nThis section provides a critique of the original visualization and comments on both clarity and aesthetic aspects that could be further improved on. A total of 8 clarity issues and 5 aesthetic issues (as shown below) were identified.\r\n\r\n\r\n\r\nFigure 2: Critique on Original Visualization\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nIssue\r\nComments\r\n1\r\nTitle\r\nThe purpose and objective of the original visualization was not conveyed well in the title of the chart. It misleads people into thinking that the graph shows absolute number of labour force by age when it is in fact showing the share of each age group within the work force.\r\n2\r\nSubtitle\r\nSubtitle that says “Per Cent” does not elaborate on what this per cent is referring to, nor explain which figure is the percentage derived from what base. Together with the title, it confuses viewers on the data being presented.\r\n3\r\nAxis Label\r\nMissing explanation for the “June 2009” and “June 2019” row data – without reading the paragraph before, there is no easy way to figure out that these numbers refer to share of workers in each age group within the labour force.\r\n4\r\nY-Axis\r\nThe graphs are literally floating with no Y-axis and its corresponding values (much less any gridlines) to anchor the actual value corresponding to each age group – this is as good as drawing random lines and is a critical flaw of the original viz. There is no easy way to know if the lines are corresponding to the correct Y-value even if we are provided with the data.\r\n5\r\nChoice of Viz Type\r\nSince the data is segregated by discrete age bins, line graph – which are more suitable for continuous x-variables, should be avoided to prevent giving false impression that the data is continuous within the bin (e.g. a kink for the 45-49 age, it leaves room for misinterpretation that a downtrend from 45 years old changed to an uptrend at 47 years old). This is especially confusing as there are no softgrid guiding where the bins cut-off\r\n6\r\nComparison Across Year\r\nSince the objective of the visualization is to explain that there are more older workers in the labour force, the choice of two line graphs is inefficient as it requires viewers to do a mental comparison of the higher line to derive the changes over time. Bearing the objective in mind, the difference between the two years could have been calculated and directly presented instead.\r\n7\r\nLead-in Paragraph\r\nLead-in paragraph is not supported by the visualization, in fact, it creates more confusion. While the age bins are split into 5-year bands (e.g. 15-19, with the only exception being those above 70), the paragraphs discuss the share of labour force by bigger bins, lumping together those aged 55 and over, as well as the 25-54 groups. This creates confusion as the figures quotes – “from 16% in 2009 to 25% in 2019” and “declined from 75% to 67%” - are all not interpretable from the visualization. The need for mental sums to add up the percentages across a few data points presented in the table is unintuitive and user-unfriendly. In terms of comparison between the years, author could have also enhance the readability by deriving the change in percentage points across the two years.\r\n8\r\nChoice of Data\r\nAs a general comment to the overall choice of data for the discussion, it might be clearer to talk about the change in Labour Force Participation Rate (LFPR) for each age group, rather than the composition of labour force – which could be more indicative of demographic change (e.g. ageing population) than shift in labour decisions.\r\nAesthetic\r\nS/N\r\nIssue\r\nComments\r\n9\r\nDefinition\r\nVisualization appears grainy and pixelated.\r\n10\r\nData Points and Labels\r\nNo softgrid nor data point to guide visual on which year corresponds to which point\r\n11\r\nFont Consistency\r\nInconsistent font colour for same data source – blue for the line is different from the blue words on chart, which is again different for the blue in the table below\r\n12\r\nChoice of Font Colours\r\nChoice of font colour does not contrast with background as well, hence not easy to read\r\n13\r\nAlignment\r\nInformation (Source and Note) at the bottom not aligned\r\nSection B: Suggested Improvement\r\nThis section provides some suggested improvements that could be implemented to resolve issues discussed in Section A.\r\nClarity\r\nS/N\r\nIssues\r\nSuggested Improvements\r\n1\r\nTitle\r\nThe title of the visualization could be modified to reflect the key message that the viz is trying to convey, and should correspond accurately to the main features of the viz\r\n2\r\nSubtitle\r\nSubtitle could be modified to provide key information to guide viewers in deciphering the viz (e.g. data and corresponding unit presented in the viz, year of data, location, and X-axis variable)\r\n3\r\nAxis Label\r\nProvide clear axis labels with accurate units of measure to prevent confusing readers\r\n4\r\nY-Axis\r\nInclusion of a Y-axis with suitable tick marks and guiding soft gridlines to enhance readability is important\r\n5\r\nChoice of Viz Type\r\nFor discrete variables (as in the bins of age range used), a bar chart would serve to provide better clarity to prevent misinterpretation\r\n6\r\nComparison Across Year\r\nTo achieve the objective to explain that there are proportionately more older workers in the labour force in 2019 than 2009, the difference between the two years could have been calculated and directly presented for a more effective visualization.\r\n7\r\nLead-in Paragraph\r\nLead-in paragraph should be supported by the viz, and any figures quoted by the paragraph should be available and obvious from the viz. Better interpretation and processing of the data (e.g. calculating and presenting the difference, if that is the objective) would also enhance clarity of the viz.\r\n8\r\nChoice of Data\r\nUsing data on the Labour Force Participation Rate (LFPR) for each age group could provide clearer comparison to achieve the objective of the viz\r\nAesthetic\r\nS/N\r\nIssues\r\nSuggested Improvements\r\n9\r\nDefinition\r\nEnsure visualization is not pixelated and has suitable definition\r\n10\r\nData Points and Labels\r\nProvide clear background gridline to enhance readability and data points/labels for viewer’s ease of reference\r\n11\r\nFont Consistency\r\nEnsure consistent font type and colour are used to represent distinct sets of data for consistency. Useful colors will also provide additional dimensions to enhance effectiveness of viz\r\n12\r\nChoice of Font Colours\r\nTo select contrasting colours for ease of reading\r\n13\r\nAlignment\r\nAs much as possible, to provide proper alignment within viz to reduce distraction caused by messiness\r\nMakeover Concept\r\nTaking in the points discussed above, a redesigned visualization could look like the following:\r\n\r\n\r\n\r\nFigure 3: Makeover Concept\r\n\r\n\r\n\r\nSection C: Redesigned Visualization\r\nUsing Tableau, the redesigned visualization based on the discussion points and concept presented in Section B above is created as follows:-\r\nThe redesigned visualization can also be accessed via this link\r\n\r\n\r\n\r\nFigure 4: Redeisgned Visualization\r\n\r\n\r\n\r\nSection D: Step-by-Step for Viz Makeover\r\nThis section provides a step-by-step guide to recreate the redesgined visualization.\r\nStep 1 - Download and Import Data \r\nFirst, download the Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (Table 5) file via this link. Then, open Tableau Desktop to connect with the Excel file downloaded.\r\nStep 2 - Data Preparation \r\nCheck on the “Cleaned with Data Interpreter” box for Tableau to assist with data cleaning (if desire, may click on underlined “Review the results” to see data tables created). Select the “T5_T A5:Y18” to extract relevant data. Hide the first column and switch Connection on the top right to “Extract” (as we will be saving onto Tableau Public, which does not support Live connections). Save the Data Extract.\r\nStep 3 - Data Processing \r\nOnce the data are loaded, right-click on blank space under Data tab to select “Create Calculated Field”. Create a new field named “LFPR Change (%-pt)” with the formula “[2019]-[2009]” to create a field that tells us the change in percetage point of the LFPR for each age group from 2009 to 2019.\r\nStep 4 - Simple Viz Set-up \r\nTo set up the simple visualization, drag-and-drop the Age (Year) variable into the Column field, and the (aggregated) LFPR Change (%-pt) that we have just created into the Rows field, as well as Label. and Color marks. A simple visualization resembling the final viz is created.\r\nStep 5a - Editing Viz Color \r\nAs commented in Section B above, choosing appropriate color is important for a clear visualization - in this case, since we know there are positive and negative changes, we would want red to denote negative, and blue for positive to highlight the contrast. Double click on the Color legend tab, choose the Red-Blue Diverging palette, and check on the “Use Full Color Range” box.\r\nStep 5b - Adding Informative Title and Subtitle \r\nSimilarly, informative title that informs viewer of the viz’s main message, as well as accurate subtitle to provide additional information about the data is critical for a good Viz. Double click on the title to edit as shown above (selecting font size 22 for title and size 12 for subtitle, while keeping the default font type; color of the title may also be changed to provide contrast)\r\nStep 5c - Hiding Extra Elements \r\nWe then hide the field labels for columns by right-clicking on the label and selecting the hide option, and also hide the color bar card by clicking on the triangle at the top-right-hand corner of the card and selecting “Hide Card” (as shown).\r\nStep 5d - Formatting Labels \r\nNext, we right-click on the blank space on the viz and select “Format” to trigger the Format pane - on the Fields dropdown bar, select “SUM(LFPR Change (%-pt))”. Under Default, click on drop-down for Numbers, select “Number (Custom)” and change decimal places to “1” - this will change the percentage point changes to 1 decimal place. Under the same Default category, change the font size to 10, Similarly, switch the tab from “Pane” to “Axis” on the Format panel, and switch the default font to size 10 and Bold the font.\r\nStep 5e - Alias for X-Axis \r\nWe may notice that the X-axis label has large spacing between the two fringe of age range - return to the Data Source Sheet, right-click on the age column, select “Edit Aliases” and proceed to remove spacing for all age bins. For the last bin, change to “70&Older”.\r\nStep 5f - Remove Total \r\nLastly, since Total does not provide meaningful information here, we right-click on it and select Exclude to exclude this data.\r\nStep 6 - Basic Viz \r\nThat completes the set-up of the basic visualization. Remember to give the Worksheet a name and save the Tableau Workbook. Next, we will create a table that shows supporting data on LFRP for each age group in 2009 and 2019. This will provide more information for the visualization that will be useful when making observations.\r\nStep 7a - Supporting Tables Set-Up \r\nCreate a new Tableau Worksheet. Drag-and-drop Age (Years) into the Columns field, aggregated 2009 and 2019 data points into the Text Mark (as shown above), click on “Show Me” on the top-right hand corner of the viz and select the Data Table Viz. Next, click on the “Swap Rows and Columns” button on the panel above (or press Ctrl+W)\r\nStep 7b - Supporting Tables \r\nAs a final step for the supporting data table, exclude the Total column as shown above.\r\nStep 8a - Dashboard Setup \r\nTo incorporate various layout elements, create a new Dashboard on Tableau. Drag-and-drop the first Worksheet and then stack the Table worksheet below. Hide the Field Labels for Columns and the Axis label for the table by right-clicking on them individually and selecting the respective hide options. On the Dashboard panel on the left, resize the Dashboard to fit automatically be selecting the “Automatic” option under Size dropdown menu.\r\nStep 8b - Lead-In Paragraph \r\nAdd a Tiled Text object (from the bottom left corner as shown above) by drag-and-dropping a text object above the main Viz worksheet (i.e. top of the dashboard viz). Include the write-up as shown to explains the visualization and enhance the readability by highlighting some key/obvious findings corresponding to the viz. \r\nStep 8c - Axis Label for Supporting Table \r\nA good visualization should be clearly labeled - add in another text object to the left of the supporting data table at the bottom to inform viewer of the data being presented in the table, along with the unit of measure. Resize the text object and format it accordingly as shown.\r\nStep 8d - Appropriate Spacing \r\nAppropriate spacing to indent different section of a viz enhances its overall readability - include Blank objects at appropriate space and readjust elements to create well-aligned viz. \r\nStep 9a - Drawing Viewer’s Attention \r\nTo accentuate the key message found in the lead-in paragraph, it might even help to conscientiously draw viewer’s attention to a particular segment of the viz. To achieve this, we first create a floating Vertical object and place it above the bars showing where the Senior age groups are.\r\nStep 9b - Define Terms \r\nMaking use of the space in the viz, we enhance the clarity further by providing the definition of “Senior”. In this case, we anchor a Tiled Text object with the definition “Senior (Aged 60 & Older)” (which is in alignment with the Singapore’s Legal definition) onto the floating Vertical object by drag-and-dropping a Text object onto the floating object while holding down the Shift key.\r\nStep 9c - Cosmetic Changes \r\nWe then select the floating vertical object and under the triangle on the top right corner, select “Distribute Contents Evenly” and format the layout of the object as shown above (select colour, and change opacity to 5%)\r\nStep 9d - Cosmetic Changes II \r\nWe further add on another line to create a visual divide for “Seniors vs the Rest”. This is done by creating another vertical object but with a width of 1px - formatting is as shown above.\r\nStep 10 - Final Touch \r\nAnd finally, as we have floating objects which may be displaced when size of visualization changes, we revert the size of the visualization to a custom size fitting the resolution when the viz is created - in this case, 1,575px x 764px. This will also ensure the layout formatting will not have too drastic a change when the viz is uploaded onto Tableau Public.\r\nStep 11 - Upload \r\nAnd for the very last step, we save the visualization onto Tableau Public.\r\nFinal Product available on Tableau Public \r\nTada!\r\nSection E: Observations\r\nThe first key observation based on the redesigned visualization is that the three Senior age groups has the largest increase in Labour Force Participation Rate (LFPR) from 2009 to 2019 (Note: according to senior-citizen-singapore.com, the Senior Citizen Act of Singapore defines a “Senior” as someone who has attained 60 years or higher). This is immediately brought to focus both by the segmented region with shaded background and captioned as “Seniors (Aged 60 & Older)”, as well as the title, which directly informs the reader of this most obvious and key takeaway from the visualization. The largest single age-group increase in LFPR belongs to those aged 65-69 year-old - increasing by 16.2 percentage point, from 2009’s 29.9% participation rate to 2019’s 46.1% participation rate. One of the reasons for this could be the increase in the legal re-employment age from 65 to 67 from 1 July 2017. This would mean that employers must offer re-employment to eligible employees up to age of 67 instead of 65 - that is, more elderly would be protected by law to be able to continue working past 65 years old if eligible. The next two age-groups with highest increase in LFPR are the 60-64 year-old and those 70 & older - as Singapore’s average life expectancy increased from 81.4 years in 2009 to 83.6 years in 2019, it will be a new norm for more seniors to be at work for an ageing Singapore. The reasons are twofold: (i) active working age will need to be lengthen to save up more for longer retirement years; and (ii) older workers may choose to stay in the workforce longer to keep them physically and mentally active, keeping demantia and loneliness at bay. All in all, while the change in Senior’s LFPR is obvious from the visualization, its reason is manyfolds.\r\nThe second key observation from the chart is the other elephant in the room: the only age group that saw a decline in its LFPR - those aged 25-29 year-old. One plausible reason for this could be an increase in average schooling years of residents aged 25 and over, from 2009’s 9.7 years to 11,2 years in 2019. This is further supported by the increase in proportion of residents who had attained University degree as their highest qualification - from 22.5% in 2009 to 32.4% in 2019. Both these statistics point to the fact that people are increasingly spending more time schooling than working, and hence a reduction in the LFPR.\r\nLastly, let’s discuss the flat plateau for those aged between 30 to 59 which saw the LFPR within the age group increase modestly, ranging from 0.8 percentage point to 6.6 percentage point. From the main viz, it told the factual story that the LFPR for this group of residents did not increase much for the 10 year from 2009 to 2019. However, this is where it is crucial to drill deeper into details and understand the importance of the supporting data table included in the visualization - the actual LFPR (%) for each age group. Based on the table, it is easy to realise that the participation rate for this main bunch of residents were already very high in 2009 to begin with (from 68.4% to 89.3%) - that is, majority of the subpopulation within these age groups were already actively participating in the labour force (i.e. either employed or actively looking for job). As there are bound to be discouraged workers and some form of frictional unemployment that triggers individual to leave the labour force, it is much more difficult to increase the LFPR for age-groups where the rate was already high, especially those nearer to the 100%. In summary, it is not unexpected to see low LFPR percentage change for these age groups with higher LFPR and there is no cause for worry. It would, however, be interesting to see how this figure has changed for the year of 2020 when the unanticipated adverse event in the form of global pandemic hit.\r\nAs a rejoiner, it is thus important to provide clear and informative visualization that are aesthetically pleasing - such observations mentioned in this section would have been difficult to arrive at with the original visualization that lacked clarity in the information presented and key message it is trying to drive at.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T23:07:00+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Jason's Data Analytics Blog",
    "description": "Welcome to my blog, I hope you enjoy \nreading the content of it!",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-01-23",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-23T16:42:09+08:00",
    "input_file": {}
  }
]
