[
  {
    "path": "posts/2021-02-06-dataviz-makeover-2/",
    "title": "dataviz-makeover-2",
    "description": "This post presents a critical review, recommendations, and makeover of a visualization using data obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github\n\nThis post constitutes part of the assessment for credit towards the Singapore Management Univerisity module ISSS608 Visual Analytics and Application, AY2020/2021 Term 2. \n\nFinal redesigned visualization can be found on this link:",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-02-06",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSection A: Critique of Original Viz\r\nClarity\r\nAesthetic\r\n\r\nSection B: Suggested Improvement\r\nClarity\r\nAesthetic\r\nMakeover Concept\r\n\r\nSection C: Redesigned Visualization\r\nSection D: Step-by-Step for Viz Makeover\r\nPart 1 - Data Preparation\r\nPart 2 - Creating Divergent Stacked Bar\r\nPart 3 - Creating Bar Chart to Include as ToolTip\r\nPart 4 - Visualizing Uncertainty\r\nPart 5 - Interactive Dashboard\r\n\r\nSection E: Observations\r\n\r\nThe original xxx\r\n\r\n\r\n\r\nSection A: Critique of Original Viz\r\nThis section provides a critique of the original visualization and comments on both clarity and aesthetic aspects that could be further improved on. A total of 8 clarity issues and 5 aesthetic issues (as shown below) were identified.\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nIssue\r\nComments\r\n1\r\nxxx\r\nxxx\r\n2\r\nxxx\r\nxxx\r\n3\r\nxxx\r\nxxx\r\nAesthetic\r\nS/N\r\nIssue\r\nComments\r\n1\r\nxxx\r\nxxx\r\n2\r\nxxx\r\nxxx\r\n3\r\nxxx\r\nxxx\r\nSection B: Suggested Improvement\r\nThis section provides some suggested improvements that could be implemented to resolve issues discussed in Section A.\r\nClarity\r\nS/N\r\nIssue\r\nSuggested Improvements\r\n1\r\nxxx\r\nxxx\r\n2\r\nxxx\r\nxxx\r\n3\r\nxxx\r\nxxx\r\nAesthetic\r\nS/N\r\nIssue\r\nSuggested Improvements\r\n1\r\nxxx\r\nxxx\r\n2\r\nxxx\r\nxxx\r\n3\r\nxxx\r\nxxx\r\nMakeover Concept\r\nTaking in the points discussed above, a redesigned visualization could look like the following:\r\n\r\n\r\n\r\nSection C: Redesigned Visualization\r\nUsing Tableau, the redesigned visualization based on the discussion points and concept presented in Section B above is created as follows:-\r\nThe redesigned visualization can also be accessed via this link\r\n\r\n\r\n\r\nSection D: Step-by-Step for Viz Makeover\r\nThis section provides a step-by-step guide to recreate the redesgined visualization.\r\nPart 1 - Data Preparation\r\nStep 1.1 - Download and Import Data\r\nFirst, download the data files used via this link to the Imperial College London YouGov Covid-19 Behaviour Tracker Data Hub.\r\nAs the data files are separated by the various countries for which the surveys are conducted, with some being zipped up in zip folders, we will next need to unzip these files. For the ease of data retrieval later on, we will store all the country files to be used in one common folder.\r\nThereafter, open Tableau Prep Builder to prepare for the data wrangling process.\r\nStep 1.2 - Importing Mulitple CSV files\r\nDrag-and-Drop one of the country file to be used onto the home page of Tableau Prep Builder. Under the ‘Input’ panel, select ‘Muiltple Files’, click on ‘Wildcard union’, then search in the folder where all the country files to be used are stored. Click ‘Apply’\r\n\r\nStep 1.3 - Filtering Relevant Data\r\nOnce all the datasets are joined, uncheck all fields then check on the box of the following relevant fields to select them for retention:\r\nVac_1, vac2_1, vac2_2, vac2_3, vac2_6, vac_3\r\nendtime\r\ngender\r\nage\r\nemployment_status, employment_status_1 through employment_status_7\r\nhousehold_size, household_children\r\nFile paths\r\nOnce that has been applied, we next filter the data to focus on records from year 2021: click on the ‘Filter Value’ tab, and input the following calculation, then click Apply and Save\r\n\r\nStep 1.4 - Data Issue: Pivoted Employment Fields\r\nThere are numerous data issue with the employment_status fields. Most obviously, Nordic countries Sweden, Denmark, Norway and Finland actually pivoted the employment_status field to form 7 different columns for each of the responses. The real problem, however, is that there are overlaps in positive responses to the 7 columns (i.e. they are not mutually exclusive - respondents could answer “Yes” to multiple employment status).\r\nTo resolve this issue, priority has to be devised to accord one prevailing status for rows with multiple Yes’s to the employment status. In this visualization, full-time employment will take precedence over any other status (i.e. if a respondent answers Yes to full-time employment, he/she will be recorded as having full-time employment under a recoded employment status column). Next piority, in order, will be for full-time student, then part-time employment (other status has no overlaps). The above logical recoding of the employment status field can be achieved by creating the following calculated field:\r\n\r\nStep 1.5 - Renaming Fields and Values\r\nNext, we rename the File Path variable to ‘Countries’, remove the ‘.csv’ at the end of each entry, then capitalize the country name.\r\n\r\nFor the Household Size and Household Children fields, we regroup all categories 8 and above as ‘8 or More’. ‘Don’t know’ and ‘Prefer not to say’ entries are recoded as null.\r\nStep 1.6 - Output Data\r\nFinally, include an Output node on the Prep Building flow\r\n\r\nOutput the cleaned data as a csv file back to the folder where the datasets were stored, with the following options:\r\n\r\nPart 2 - Creating Divergent Stacked Bar\r\nStep 2.1 - Importing Data & Assigning Variable Types\r\nFirst, open Tableau then import the merged and cleaned dataset by drag-and-dropping it onto the main page.\r\nTableau automatically assigns variables with integer values as Measures - this is not accurate for our survey response variables where 1 represents ‘Strongly Agree’ and 5 ‘Strongly Disagree’. Hence, we shift these vac_x variables from the Measures section to the Dimension section\r\n\r\nStep 2.2 - Creating Variables for Stacked Bar\r\nWe start by assigning 1 to all entry and call it ‘No. Record’ - this will come in handy when we calculate the survey entries\r\n\r\nNext, we sum up the records by country - note: we would typically get the total sum (which would sum up the records across the table), but for the purpose of our viz, we will hold country fixed\r\n\r\nWe will need a Parameter to toggle between the different questions we have included in the viz, soliciting user to select a question of interest:\r\n\r\nThe Parameter will then need to be “activated” to trigger response to the viz, using the CASE function in a new calculated field\r\n\r\nNext, we want to survey responses which are more than 2 (neutral, disagree, strongly disagree) to bear a weight of 1 for a variable called ‘Count Negative’ - this will allow these responses to start from left of the middle origin y-axis divider later.\r\n\r\nSum up this variable across the table in the variable ‘Total Count Negative’\r\n\r\nNext, we need the percentage of responses that selected each response foe the selected question (Strongly Agree, Agree, etc.), out of the total record\r\n\r\nAnd because the divergent bars are ultimately a Gnatt chart, we will need a variable to tell the individual response value where to start - by dividing the Total Count Negative by the sum of Total Count (with a negative in front), we will be able to identify where the values bigger than 2 (i.e. neutral, disagree, strongly disagree) will start from the left of the y-axis.\r\n\r\nThe final variable to create for the basic stacked bars is a little more tricky - we need a variable to tell us how long the bar for each response should be when stacked together. We first find where the bar starts, then add the percentage of the next row, skipping null values (note: up to this step, Tableau will compute this across table, later on we will specify for it to compute using each responded value, together with Gnatt Start, it will then start where the previous response value ends, then add all entries with that response value together, then restart for each response value)\r\n\r\nStep 2.3 - Divergent Stacked Bar\r\nNow we put everything together. We drag-and-drop Countries to Rows, Gnatt Percent to Columns, change the chart type to Gnatt Bar, drop Question Selected to Colour and another one to Detail, and finally Percentage to Size\r\n\r\nThereafter, we go to the little triangle on the green Gnatt Percent pill, ‘Compute Using’ option, and select ‘Question Selected’. Do the same for the green Percentage pill under Size.\r\n\r\nUnder Colour, click on ‘Edit Colors…’, select dark blue for 1, light blue for 2, muted neutral color for 3, light pink for 4, and bright red for 5. Right-click on the Question Selected blue pill under colour, and select ‘Sort’. Under ‘Sort By’, choose Manual, and arrange then in 3>4>5>1>2 order (based on conclusion from Section B)\r\n\r\nAnd there, a basic Divergent Stacked Bar is created! One last touch - to change the negative percentage on the left of Y-axis to positive. Right-click on the X-axis, select Format, under Scale, Numbers, choose ‘Custom’ and type ‘0%;0%’ as the format\r\n\r\nStep 2.4 - Sort Viz\r\nWe want to create a sorting variable (which will also be used in the following portion of our viz) - ‘Pro Percent’ - to calculate percentage of respondents who provided positive response to the questions asked (i.e. either Strongly Agree or Agree). But first, we need to sum up all the positive responses with a new ‘Value’ field\r\n\r\nThen divide this value by the number of records to get the percentage of positive responses\r\n\r\nAnd finally, we can go back to the Country under Rows, right-click and select ‘Sort’, select ‘Field’ under ‘Sort By’, Descending order, ‘Pro Percent’ under Field Name, and leave Custom as the Aggregation.\r\n\r\nPart 3 - Creating Bar Chart to Include as ToolTip\r\nStep 3.1 - Creating Bar Chart\r\nFirst, create a new Worksheet on Tableau. Before we do anything further, we create a new variable - ‘Ranked Response’ - to transform the 1-5 code into actual description of the response (e.g. Strongly Agree etc.)\r\n\r\nNext, at the new Worksheet, we drag-and-drop No. Record onto Columns, and Ranked Response onto Rows and Color box, then Percentage into Label box. Change the color of the viz using the ‘Pick Screen Color’ option to ensure consistency\r\n\r\nStep 3.2 - ToopTip linking sheets\r\nWe head back to the Divergent Stacked Bar sheet, and input the following into ToolTip\r\n\r\nHowever, we notice that the Ranked Response does not change color when we hover over each of the different ranked responses. Hence, we create another 5 separate variable to create to color changing effect\r\n\r\nThe above uses Strongly Agree as an example, the process is repeated to create 4 other variables for the four other response value. Next, put all 5 newly created variable into ToolTip\r\n\r\nFinally, edit the ToolTip as follows:\r\n\r\nAnd the complete Stacked Bar Chart with informative summary and ToolTip showing overall survey response from the country is created!\r\n\r\nPart 4 - Visualizing Uncertainty\r\nStep 4.1 - Creating Variables Required\r\nWe have created two important variables earlier (Value and Pro Percent). Next, we will need a few more variables that measure uncertainty. Starting with the Standard Error\r\n\r\nZ-scores \r\nError Margins \r\n95% Bounds \r\n99% Bounds \r\nConfidence Intervals \r\nA Parameter to allow toggling between 95% and 99% CI \r\nUpper and Lower Bound based on Parameter input \r\nAnd one final variable to display as marginal value for the upper and lower confidence interval \r\nStep 4.2 - Creating Basic Uncertainty Viz\r\nFirst, drag-and-drop Countries onto Rows and Pro Percent onto Column\r\n\r\nNext, drag-and-drop Measure Values onto Columns; a list of variables will appear on the Measure Value panel to the left of the viz, remove all except ‘AGG(Upper CI Selected)’ and ‘AGG(Lower CI Selected)’. On the Measure Value green pill under Columns, right-click and select Dual Axis,\r\n\r\nOn the Measure Values tab under the Marks panel, select Line as the chart type, then drag-and-drop the blue Measure Names pill under Detail to Path. Click on Color to change it to a grey color to distinguish from the dotted mean, and reduce the size of the lines.\r\n\r\nRight-click on the top Axis to select Synchronize Axis, then uncheck Show Header to turn it off.\r\n\r\nSort the Y-axis by descending Pro Percent (as with earlier Divergent Stacked Bar viz)\r\n\r\nOn the AGG(Pro Percent) tab under the Marks panel, drag-and-drop Pro Percent to Label; edit the labels to a smaller font (6pt) and ensure the format is Percentage (no decimal point). Similarly, X-axis should also be in Percentage format. Right click on the X-axis and select ‘Move marks to front’ if not already at the front.\r\n\r\nSelect Entire View on the view option. Drag-and-drop both the ‘CI %-pt (+/-)’ and ‘No. Record’ variable onto Rows, then click on both the pills to change them from Continuous to Discrete. Format the ‘CI %-pt (+/-)’ rows to retain 4 decimal points.\r\n\r\nEdit the sizes of the data information, reduce data ink, and change the axis title. And theere we have our basic uncertainty viz\r\n\r\nStep 4.3 - ToolTip\r\nWe include a ToolTip to summarise the data points when hovered over\r\n\r\nStep 4.4 - Filters\r\nBefore we put everything together, let’s create one more filter - Age Group\r\n\r\nWe then drag-and-drop Gender, Age Group, Employment Status, Household Size, and Household Children onto the Filter panel, show all the filters. To save space, we will change Gender to single value drop-down, while the rest of the filters to multiple-values drop-down. Find the two Parameters on the Parameters panel on the bottom-left, and show both the Select Question and CI parameters as well.\r\n\r\nFor each of the filter, we click on the small triangle beside them, go to ‘Apply to Worksheet’, select ‘Selected Worksheet’ and check the box beside ‘Divergent Stacked Bar’ sheet. \r\nAnd there we have it, the final Visualization for Uncertainty with informative ToolTip. While the lines for the standard error margins are small in this version, it will be more obvious when we explore sub-population of each country by filtering down the dataset, which will lead to smaller number of records being available.\r\n\r\nPart 5 - Interactive Dashboard\r\nStep 5.1 - Basic Dashboard\r\nSection E: Observations\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-15T12:20:10+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-23-dataviz-makeover-1/",
    "title": "ISSS608 DataViz Makeover 1",
    "description": "This post presents a critical review, recommendations, and makeover of a visualization found in MOM's \"_Report: Labour Force in Singapore 2019_\". \n\nThis post constitutes part of the assessment for credit towards the Singapore Management Univerisity module ISSS608 Visual Analytics and Application, AY2020/2021 Term 2. \n\nFinal redesigned visualization can be found on this link: https://public.tableau.com/profile/jason.tey#!/vizhome/DataVizMakeover1_16115150979860/VizMakeover1",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-01-28",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nSection A: Critique of Original VizClarity\r\nAesthetic\r\n\r\nSection B: Suggested ImprovementClarity\r\nAesthetic\r\nMakeover Concept\r\n\r\nSection C: Redesigned Visualization\r\nSection D: Step-by-Step for Viz Makeover\r\nSection E: Observations\r\n\r\nThe original visualization presented as Chart 6 on Page 22 of MOM’s Report: Labour Force in Singapore 2019 is reproduced below\r\n\r\n\r\n\r\nFigure 1: Original Visualization by MOM, Singapore\r\n\r\n\r\n\r\nSection A: Critique of Original Viz\r\nThis section provides a critique of the original visualization and comments on both clarity and aesthetic aspects that could be further improved on. A total of 8 clarity issues and 5 aesthetic issues (as shown below) were identified.\r\n\r\n\r\n\r\nFigure 2: Critique on Original Visualization\r\n\r\n\r\n\r\nClarity\r\nS/N\r\nIssue\r\nComments\r\n1\r\nTitle\r\nThe purpose and objective of the original visualization was not conveyed well in the title of the chart. It misleads people into thinking that the graph shows absolute number of labour force by age when it is in fact showing the share of each age group within the work force.\r\n2\r\nSubtitle\r\nSubtitle that says “Per Cent” does not elaborate on what this per cent is referring to, nor explain which figure is the percentage derived from what base. Together with the title, it confuses viewers on the data being presented.\r\n3\r\nAxis Label\r\nMissing explanation for the “June 2009” and “June 2019” row data – without reading the paragraph before, there is no easy way to figure out that these numbers refer to share of workers in each age group within the labour force.\r\n4\r\nY-Axis\r\nThe graphs are literally floating with no Y-axis and its corresponding values (much less any gridlines) to anchor the actual value corresponding to each age group – this is as good as drawing random lines and is a critical flaw of the original viz. There is no easy way to know if the lines are corresponding to the correct Y-value even if we are provided with the data.\r\n5\r\nChoice of Viz Type\r\nSince the data is segregated by discrete age bins, line graph – which are more suitable for continuous x-variables, should be avoided to prevent giving false impression that the data is continuous within the bin (e.g. a kink for the 45-49 age, it leaves room for misinterpretation that a downtrend from 45 years old changed to an uptrend at 47 years old). This is especially confusing as there are no softgrid guiding where the bins cut-off\r\n6\r\nComparison Across Year\r\nSince the objective of the visualization is to explain that there are more older workers in the labour force, the choice of two line graphs is inefficient as it requires viewers to do a mental comparison of the higher line to derive the changes over time. Bearing the objective in mind, the difference between the two years could have been calculated and directly presented instead.\r\n7\r\nLead-in Paragraph\r\nLead-in paragraph is not supported by the visualization, in fact, it creates more confusion. While the age bins are split into 5-year bands (e.g. 15-19, with the only exception being those above 70), the paragraphs discuss the share of labour force by bigger bins, lumping together those aged 55 and over, as well as the 25-54 groups. This creates confusion as the figures quotes – “from 16% in 2009 to 25% in 2019” and “declined from 75% to 67%” - are all not interpretable from the visualization. The need for mental sums to add up the percentages across a few data points presented in the table is unintuitive and user-unfriendly. In terms of comparison between the years, author could have also enhance the readability by deriving the change in percentage points across the two years.\r\n8\r\nChoice of Data\r\nAs a general comment to the overall choice of data for the discussion, it might be clearer to talk about the change in Labour Force Participation Rate (LFPR) for each age group, rather than the composition of labour force – which could be more indicative of demographic change (e.g. ageing population) than shift in labour decisions.\r\nAesthetic\r\nS/N\r\nIssue\r\nComments\r\n9\r\nDefinition\r\nVisualization appears grainy and pixelated.\r\n10\r\nData Points and Labels\r\nNo softgrid nor data point to guide visual on which year corresponds to which point\r\n11\r\nFont Consistency\r\nInconsistent font colour for same data source – blue for the line is different from the blue words on chart, which is again different for the blue in the table below\r\n12\r\nChoice of Font Colours\r\nChoice of font colour does not contrast with background as well, hence not easy to read\r\n13\r\nAlignment\r\nInformation (Source and Note) at the bottom not aligned\r\nSection B: Suggested Improvement\r\nThis section provides some suggested improvements that could be implemented to resolve issues discussed in Section A.\r\nClarity\r\nS/N\r\nIssues\r\nSuggested Improvements\r\n1\r\nTitle\r\nThe title of the visualization could be modified to reflect the key message that the viz is trying to convey, and should correspond accurately to the main features of the viz\r\n2\r\nSubtitle\r\nSubtitle could be modified to provide key information to guide viewers in deciphering the viz (e.g. data and corresponding unit presented in the viz, year of data, location, and X-axis variable)\r\n3\r\nAxis Label\r\nProvide clear axis labels with accurate units of measure to prevent confusing readers\r\n4\r\nY-Axis\r\nInclusion of a Y-axis with suitable tick marks and guiding soft gridlines to enhance readability is important\r\n5\r\nChoice of Viz Type\r\nFor discrete variables (as in the bins of age range used), a bar chart would serve to provide better clarity to prevent misinterpretation\r\n6\r\nComparison Across Year\r\nTo achieve the objective to explain that there are proportionately more older workers in the labour force in 2019 than 2009, the difference between the two years could have been calculated and directly presented for a more effective visualization.\r\n7\r\nLead-in Paragraph\r\nLead-in paragraph should be supported by the viz, and any figures quoted by the paragraph should be available and obvious from the viz. Better interpretation and processing of the data (e.g. calculating and presenting the difference, if that is the objective) would also enhance clarity of the viz.\r\n8\r\nChoice of Data\r\nUsing data on the Labour Force Participation Rate (LFPR) for each age group could provide clearer comparison to achieve the objective of the viz\r\nAesthetic\r\nS/N\r\nIssues\r\nSuggested Improvements\r\n9\r\nDefinition\r\nEnsure visualization is not pixelated and has suitable definition\r\n10\r\nData Points and Labels\r\nProvide clear background gridline to enhance readability and data points/labels for viewer’s ease of reference\r\n11\r\nFont Consistency\r\nEnsure consistent font type and colour are used to represent distinct sets of data for consistency. Useful colors will also provide additional dimensions to enhance effectiveness of viz\r\n12\r\nChoice of Font Colours\r\nTo select contrasting colours for ease of reading\r\n13\r\nAlignment\r\nAs much as possible, to provide proper alignment within viz to reduce distraction caused by messiness\r\nMakeover Concept\r\nTaking in the points discussed above, a redesigned visualization could look like the following:\r\n\r\n\r\n\r\nFigure 3: Makeover Concept\r\n\r\n\r\n\r\nSection C: Redesigned Visualization\r\nUsing Tableau, the redesigned visualization based on the discussion points and concept presented in Section B above is created as follows:-\r\nThe redesigned visualization can also be accessed via this link\r\n\r\n\r\n\r\nFigure 4: Redeisgned Visualization\r\n\r\n\r\n\r\nSection D: Step-by-Step for Viz Makeover\r\nThis section provides a step-by-step guide to recreate the redesgined visualization.\r\nStep 1 - Download and Import Data \r\nFirst, download the Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (Table 5) file via this link. Then, open Tableau Desktop to connect with the Excel file downloaded.\r\nStep 2 - Data Preparation \r\nCheck on the “Cleaned with Data Interpreter” box for Tableau to assist with data cleaning (if desire, may click on underlined “Review the results” to see data tables created). Select the “T5_T A5:Y18” to extract relevant data. Hide the first column and switch Connection on the top right to “Extract” (as we will be saving onto Tableau Public, which does not support Live connections). Save the Data Extract.\r\nStep 3 - Data Processing \r\nOnce the data are loaded, right-click on blank space under Data tab to select “Create Calculated Field”. Create a new field named “LFPR Change (%-pt)” with the formula “[2019]-[2009]” to create a field that tells us the change in percetage point of the LFPR for each age group from 2009 to 2019.\r\nStep 4 - Simple Viz Set-up \r\nTo set up the simple visualization, drag-and-drop the Age (Year) variable into the Column field, and the (aggregated) LFPR Change (%-pt) that we have just created into the Rows field, as well as Label. and Color marks. A simple visualization resembling the final viz is created.\r\nStep 5a - Editing Viz Color \r\nAs commented in Section B above, choosing appropriate color is important for a clear visualization - in this case, since we know there are positive and negative changes, we would want red to denote negative, and blue for positive to highlight the contrast. Double click on the Color legend tab, choose the Red-Blue Diverging palette, and check on the “Use Full Color Range” box.\r\nStep 5b - Adding Informative Title and Subtitle \r\nSimilarly, informative title that informs viewer of the viz’s main message, as well as accurate subtitle to provide additional information about the data is critical for a good Viz. Double click on the title to edit as shown above (selecting font size 22 for title and size 12 for subtitle, while keeping the default font type; color of the title may also be changed to provide contrast)\r\nStep 5c - Hiding Extra Elements \r\nWe then hide the field labels for columns by right-clicking on the label and selecting the hide option, and also hide the color bar card by clicking on the triangle at the top-right-hand corner of the card and selecting “Hide Card” (as shown).\r\nStep 5d - Formatting Labels \r\nNext, we right-click on the blank space on the viz and select “Format” to trigger the Format pane - on the Fields dropdown bar, select “SUM(LFPR Change (%-pt))”. Under Default, click on drop-down for Numbers, select “Number (Custom)” and change decimal places to “1” - this will change the percentage point changes to 1 decimal place. Under the same Default category, change the font size to 10, Similarly, switch the tab from “Pane” to “Axis” on the Format panel, and switch the default font to size 10 and Bold the font.\r\nStep 5e - Alias for X-Axis \r\nWe may notice that the X-axis label has large spacing between the two fringe of age range - return to the Data Source Sheet, right-click on the age column, select “Edit Aliases” and proceed to remove spacing for all age bins. For the last bin, change to “70&Older”.\r\nStep 5f - Remove Total \r\nLastly, since Total does not provide meaningful information here, we right-click on it and select Exclude to exclude this data.\r\nStep 6 - Basic Viz \r\nThat completes the set-up of the basic visualization. Remember to give the Worksheet a name and save the Tableau Workbook. Next, we will create a table that shows supporting data on LFRP for each age group in 2009 and 2019. This will provide more information for the visualization that will be useful when making observations.\r\nStep 7a - Supporting Tables Set-Up \r\nCreate a new Tableau Worksheet. Drag-and-drop Age (Years) into the Columns field, aggregated 2009 and 2019 data points into the Text Mark (as shown above), click on “Show Me” on the top-right hand corner of the viz and select the Data Table Viz. Next, click on the “Swap Rows and Columns” button on the panel above (or press Ctrl+W)\r\nStep 7b - Supporting Tables \r\nAs a final step for the supporting data table, exclude the Total column as shown above.\r\nStep 8a - Dashboard Setup \r\nTo incorporate various layout elements, create a new Dashboard on Tableau. Drag-and-drop the first Worksheet and then stack the Table worksheet below. Hide the Field Labels for Columns and the Axis label for the table by right-clicking on them individually and selecting the respective hide options. On the Dashboard panel on the left, resize the Dashboard to fit automatically be selecting the “Automatic” option under Size dropdown menu.\r\nStep 8b - Lead-In Paragraph \r\nAdd a Tiled Text object (from the bottom left corner as shown above) by drag-and-dropping a text object above the main Viz worksheet (i.e. top of the dashboard viz). Include the write-up as shown to explains the visualization and enhance the readability by highlighting some key/obvious findings corresponding to the viz. \r\nStep 8c - Axis Label for Supporting Table \r\nA good visualization should be clearly labeled - add in another text object to the left of the supporting data table at the bottom to inform viewer of the data being presented in the table, along with the unit of measure. Resize the text object and format it accordingly as shown.\r\nStep 8d - Appropriate Spacing \r\nAppropriate spacing to indent different section of a viz enhances its overall readability - include Blank objects at appropriate space and readjust elements to create well-aligned viz. \r\nStep 9a - Drawing Viewer’s Attention \r\nTo accentuate the key message found in the lead-in paragraph, it might even help to conscientiously draw viewer’s attention to a particular segment of the viz. To achieve this, we first create a floating Vertical object and place it above the bars showing where the Senior age groups are.\r\nStep 9b - Define Terms \r\nMaking use of the space in the viz, we enhance the clarity further by providing the definition of “Senior”. In this case, we anchor a Tiled Text object with the definition “Senior (Aged 60 & Older)” (which is in alignment with the Singapore’s Legal definition) onto the floating Vertical object by drag-and-dropping a Text object onto the floating object while holding down the Shift key.\r\nStep 9c - Cosmetic Changes \r\nWe then select the floating vertical object and under the triangle on the top right corner, select “Distribute Contents Evenly” and format the layout of the object as shown above (select colour, and change opacity to 5%)\r\nStep 9d - Cosmetic Changes II \r\nWe further add on another line to create a visual divide for “Seniors vs the Rest”. This is done by creating another vertical object but with a width of 1px - formatting is as shown above.\r\nStep 10 - Final Touch \r\nAnd finally, as we have floating objects which may be displaced when size of visualization changes, we revert the size of the visualization to a custom size fitting the resolution when the viz is created - in this case, 1,575px x 764px. This will also ensure the layout formatting will not have too drastic a change when the viz is uploaded onto Tableau Public.\r\nStep 11 - Upload \r\nAnd for the very last step, we save the visualization onto Tableau Public.\r\nFinal Product available on Tableau Public \r\nTada!\r\nSection E: Observations\r\nThe first key observation based on the redesigned visualization is that the three Senior age groups has the largest increase in Labour Force Participation Rate (LFPR) from 2009 to 2019 (Note: according to senior-citizen-singapore.com, the Senior Citizen Act of Singapore defines a “Senior” as someone who has attained 60 years or higher). This is immediately brought to focus both by the segmented region with shaded background and captioned as “Seniors (Aged 60 & Older)”, as well as the title, which directly informs the reader of this most obvious and key takeaway from the visualization. The largest single age-group increase in LFPR belongs to those aged 65-69 year-old - increasing by 16.2 percentage point, from 2009’s 29.9% participation rate to 2019’s 46.1% participation rate. One of the reasons for this could be the increase in the legal re-employment age from 65 to 67 from 1 July 2017. This would mean that employers must offer re-employment to eligible employees up to age of 67 instead of 65 - that is, more elderly would be protected by law to be able to continue working past 65 years old if eligible. The next two age-groups with highest increase in LFPR are the 60-64 year-old and those 70 & older - as Singapore’s average life expectancy increased from 81.4 years in 2009 to 83.6 years in 2019, it will be a new norm for more seniors to be at work for an ageing Singapore. The reasons are twofold: (i) active working age will need to be lengthen to save up more for longer retirement years; and (ii) older workers may choose to stay in the workforce longer to keep them physically and mentally active, keeping demantia and loneliness at bay. All in all, while the change in Senior’s LFPR is obvious from the visualization, its reason is manyfolds.\r\nThe second key observation from the chart is the other elephant in the room: the only age group that saw a decline in its LFPR - those aged 25-29 year-old. One plausible reason for this could be an increase in average schooling years of residents aged 25 and over, from 2009’s 9.7 years to 11,2 years in 2019. This is further supported by the increase in proportion of residents who had attained University degree as their highest qualification - from 22.5% in 2009 to 32.4% in 2019. Both these statistics point to the fact that people are increasingly spending more time schooling than working, and hence a reduction in the LFPR.\r\nLastly, let’s discuss the flat plateau for those aged between 30 to 59 which saw the LFPR within the age group increase modestly, ranging from 0.8 percentage point to 6.6 percentage point. From the main viz, it told the factual story that the LFPR for this group of residents did not increase much for the 10 year from 2009 to 2019. However, this is where it is crucial to drill deeper into details and understand the importance of the supporting data table included in the visualization - the actual LFPR (%) for each age group. Based on the table, it is easy to realise that the participation rate for this main bunch of residents were already very high in 2009 to begin with (from 68.4% to 89.3%) - that is, majority of the subpopulation within these age groups were already actively participating in the labour force (i.e. either employed or actively looking for job). As there are bound to be discouraged workers and some form of frictional unemployment that triggers individual to leave the labour force, it is much more difficult to increase the LFPR for age-groups where the rate was already high, especially those nearer to the 100%. In summary, it is not unexpected to see low LFPR percentage change for these age groups with higher LFPR and there is no cause for worry. It would, however, be interesting to see how this figure has changed for the year of 2020 when the unanticipated adverse event in the form of global pandemic hit.\r\nAs a rejoiner, it is thus important to provide clear and informative visualization that are aesthetically pleasing - such observations mentioned in this section would have been difficult to arrive at with the original visualization that lacked clarity in the information presented and key message it is trying to drive at.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T23:07:00+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Jason's Data Analytics Blog",
    "description": "Welcome to my blog, I hope you enjoy \nreading the content of it!",
    "author": [
      {
        "name": "Jason Tey",
        "url": {}
      }
    ],
    "date": "2021-01-23",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-23T16:42:09+08:00",
    "input_file": {}
  }
]
